-- phpMyAdmin SQL Dump
-- version 4.9.0.1
-- https://www.phpmyadmin.net/
--
-- Host: localhost
-- Generation Time: May 18, 2022 at 07:33 AM
-- Server version: 10.3.16-MariaDB
-- PHP Version: 7.3.6

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `thuctap`
--

-- --------------------------------------------------------

--
-- Table structure for table `charts`
--

CREATE TABLE `charts` (
  `chart_id` int(11) NOT NULL,
  `chart_name` varchar(255) COLLATE utf8_unicode_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `CHITIETKETQUA`
--

CREATE TABLE `CHITIETKETQUA` (
  `id` int(11) NOT NULL,
  `makq` varchar(10) COLLATE utf8mb4_unicode_ci NOT NULL,
  `masv` varchar(10) COLLATE utf8mb4_unicode_ci NOT NULL,
  `dlt` int(11) NOT NULL,
  `dth` int(11) NOT NULL,
  `nhanxet` varchar(50) COLLATE utf8mb4_unicode_ci DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `CHITIETKETQUA`
--

INSERT INTO `CHITIETKETQUA` (`id`, `makq`, `masv`, `dlt`, `dth`, `nhanxet`) VALUES
(1, 'KQ001', 'CD0001', 6, 8, 'tốt'),
(2, 'KQ002', 'CD0002', 6, 8, 'tốt'),
(3, 'KQ003', 'CD0003', 6, 8, 'tốt'),
(4, 'KQ004', 'CD0004', 6, 8, 'tốt'),
(5, 'KQ005', 'CD0005', 6, 8, 'tốt'),
(6, 'KQ006', 'CD0006', 6, 8, 'tốt'),
(7, 'KQ007', 'CD0007', 6, 8, 'tốt'),
(8, 'KQ008', 'CD0008', 6, 8, 'tốt'),
(9, 'KQ009', 'CD0009', 6, 8, 'tốt'),
(10, 'KQ010', 'CD0010', 6, 8, 'tốt'),
(11, 'KQ011', 'CD0011', 6, 8, 'tốt'),
(12, 'KQ012', 'CD0012', 6, 8, 'tốt'),
(13, 'KQ013', 'CD0013', 6, 8, 'tốt'),
(14, 'KQ014', 'CD0014', 6, 8, 'tốt'),
(15, 'KQ015', 'CD0015', 6, 8, 'tốt'),
(16, 'KQ016', 'CD0016', 6, 8, 'tốt'),
(17, 'KQ017', 'CD0017', 6, 8, 'tốt'),
(18, 'KQ018', 'CD0018', 7, 8, 'tốt'),
(19, 'KQ019', 'CD0019', 7, 8, 'tốt'),
(20, 'KQ020', 'CD0020', 7, 8, 'tốt'),
(21, 'KQ021', 'CD0021', 7, 8, 'tốt'),
(22, 'KQ022', 'CD0022', 7, 8, 'tốt'),
(23, 'KQ023', 'CD0023', 7, 8, 'tốt'),
(24, 'KQ024', 'CD0024', 7, 8, 'tốt'),
(25, 'KQ025', 'CD0025', 7, 8, 'tốt'),
(26, 'KQ026', 'CD0026', 7, 8, 'tốt'),
(27, 'KQ027', 'CD0027', 7, 8, 'tốt'),
(28, 'KQ028', 'CD0028', 7, 8, 'tốt'),
(29, 'KQ029', 'CD0029', 7, 8, 'tốt'),
(30, 'KQ030', 'CD0030', 7, 8, 'tốt'),
(31, 'KQ031', 'CD0031', 7, 8, 'tốt'),
(32, 'KQ032', 'CD0032', 7, 8, 'tốt'),
(33, 'KQ033', 'CD0033', 7, 8, 'tốt'),
(34, 'KQ034', 'CD0034', 7, 8, 'tốt'),
(35, 'KQ035', 'CD0035', 7, 8, 'tốt'),
(36, 'KQ036', 'CD0036', 7, 8, 'tốt'),
(37, 'KQ037', 'CD0037', 7, 8, 'tốt'),
(38, 'KQ038', 'CD0038', 7, 8, 'tốt'),
(39, 'KQ039', 'CD0039', 7, 8, 'tốt'),
(40, 'KQ040', 'CD0040', 7, 8, 'tốt'),
(41, 'KQ041', 'CD0041', 7, 8, 'tốt'),
(42, 'KQ042', 'CD0042', 7, 8, 'tốt'),
(43, 'KQ043', 'CD0043', 7, 8, 'tốt'),
(44, 'KQ044', 'CD0044', 7, 8, 'tốt'),
(45, 'KQ045', 'CD0045', 7, 8, 'tốt'),
(46, 'KQ046', 'CD0046', 7, 8, 'tốt'),
(47, 'KQ047', 'CD0047', 7, 8, 'tốt'),
(48, 'KQ048', 'CD0048', 7, 8, 'tốt'),
(49, 'KQ049', 'CD0049', 7, 8, 'tốt'),
(50, 'KQ050', 'CD0050', 7, 8, 'tốt'),
(51, 'KQ051', 'CD0051', 7, 7, 'tốt'),
(52, 'KQ052', 'CD0052', 7, 7, 'tốt'),
(53, 'KQ053', 'CD0053', 7, 7, 'tốt'),
(54, 'KQ054', 'CD0054', 7, 7, 'tốt'),
(55, 'KQ055', 'CD0055', 7, 7, 'tốt'),
(56, 'KQ056', 'CD0056', 7, 7, 'tốt'),
(57, 'KQ057', 'CD0057', 7, 7, 'tốt'),
(58, 'KQ058', 'CD0058', 7, 7, 'tốt'),
(59, 'KQ059', 'CD0059', 7, 7, 'tốt'),
(60, 'KQ060', 'CD0060', 7, 7, 'tốt'),
(61, 'KQ061', 'CD0061', 8, 7, 'tốt'),
(62, 'KQ062', 'CD0062', 8, 7, 'tốt'),
(63, 'KQ063', 'CD0063', 8, 7, 'tốt'),
(64, 'KQ064', 'CD0064', 8, 7, 'tốt'),
(65, 'KQ065', 'CD0065', 8, 7, 'tốt'),
(66, 'KQ066', 'CD0066', 8, 7, 'tốt'),
(67, 'KQ067', 'CD0067', 8, 7, 'tốt'),
(68, 'KQ068', 'CD0068', 8, 7, 'tốt'),
(69, 'KQ069', 'CD0069', 8, 7, 'tốt'),
(70, 'KQ070', 'CD0070', 8, 7, 'tốt'),
(71, 'KQ071', 'CD0071', 8, 7, 'tốt'),
(72, 'KQ072', 'CD0072', 8, 7, 'tốt'),
(73, 'KQ073', 'CD0073', 8, 7, 'tốt'),
(74, 'KQ074', 'CD0074', 8, 7, 'tốt'),
(75, 'KQ075', 'CD0075', 8, 7, 'tốt'),
(76, 'KQ076', 'CD0076', 8, 7, 'tốt'),
(77, 'KQ077', 'CD0077', 8, 7, 'tốt'),
(78, 'KQ078', 'CD0078', 8, 7, 'tốt'),
(79, 'KQ079', 'CD0079', 8, 7, 'tốt'),
(80, 'KQ080', 'CD0080', 8, 7, 'tốt'),
(81, 'KQ081', 'CD0081', 8, 7, 'tốt'),
(82, 'KQ082', 'CD0082', 8, 7, 'tốt'),
(83, 'KQ083', 'CD0083', 8, 7, 'tốt'),
(84, 'KQ084', 'CD0084', 8, 7, 'tốt'),
(85, 'KQ085', 'CD0085', 8, 7, 'tốt'),
(86, 'KQ086', 'CD0086', 8, 7, 'tốt'),
(87, 'KQ087', 'CD0087', 8, 7, 'tốt'),
(88, 'KQ088', 'CD0088', 8, 7, 'tốt'),
(89, 'KQ089', 'CD0089', 8, 7, 'tốt'),
(90, 'KQ090', 'CD0090', 8, 7, 'tốt'),
(91, 'KQ091', 'CD0091', 8, 7, 'tốt'),
(92, 'KQ092', 'CD0092', 8, 7, 'tốt'),
(93, 'KQ093', 'CD0093', 8, 7, 'tốt'),
(94, 'KQ094', 'CD0094', 8, 7, 'tốt'),
(95, 'KQ095', 'CD0095', 8, 7, 'tốt'),
(96, 'KQ096', 'CD0096', 8, 7, 'tốt'),
(97, 'KQ097', 'CD0097', 8, 7, 'tốt'),
(98, 'KQ098', 'CD0098', 8, 7, 'tốt'),
(99, 'KQ099', 'CD0099', 8, 10, 'tốt'),
(100, 'KQ100', 'CD0100', 8, 10, 'tốt'),
(101, 'KQ101', 'CD0101', 8, 10, 'tốt'),
(102, 'KQ102', 'CD0102', 8, 10, 'tốt'),
(103, 'KQ103', 'CD0103', 8, 10, 'tốt'),
(104, 'KQ104', 'CD0104', 8, 10, 'tốt'),
(105, 'KQ105', 'CD0105', 8, 10, 'tốt'),
(106, 'KQ106', 'CD0106', 8, 10, 'tốt'),
(107, 'KQ107', 'CD0107', 8, 10, 'tốt'),
(108, 'KQ108', 'CD0108', 8, 9, 'tốt'),
(109, 'KQ109', 'CD0109', 8, 9, 'tốt'),
(110, 'KQ110', 'CD0110', 8, 9, 'tốt'),
(111, 'KQ111', 'CD0111', 8, 9, 'tốt'),
(112, 'KQ112', 'CD0112', 8, 6, 'tốt'),
(113, 'KQ113', 'CD0113', 8, 9, 'tốt'),
(114, 'KQ114', 'CD0114', 8, 9, 'tốt'),
(115, 'KQ115', 'CD0115', 8, 9, 'tốt'),
(116, 'KQ116', 'CD0116', 8, 9, 'tốt'),
(117, 'KQ117', 'CD0117', 8, 9, 'tốt'),
(118, 'KQ118', 'CD0118', 8, 9, 'tốt'),
(119, 'KQ119', 'CD0119', 8, 9, 'tốt'),
(120, 'KQ120', 'CD0120', 8, 9, 'tốt'),
(121, 'KQ121', 'CD0121', 8, 9, 'tốt'),
(122, 'KQ122', 'CD0122', 8, 9, 'tốt'),
(123, 'KQ123', 'CD0123', 8, 9, 'tốt'),
(124, 'KQ124', 'CD0124', 8, 6, 'tốt'),
(125, 'KQ125', 'CD0125', 8, 9, 'tốt'),
(126, 'KQ126', 'CD0126', 8, 9, 'tốt'),
(127, 'KQ127', 'CD0127', 8, 9, 'tốt'),
(128, 'KQ128', 'CD0128', 8, 9, 'tốt'),
(129, 'KQ129', 'CD0129', 8, 9, 'tốt'),
(130, 'KQ130', 'CD0130', 8, 9, 'tốt'),
(131, 'KQ131', 'CD0131', 9, 9, 'tốt'),
(132, 'KQ132', 'CD0132', 9, 6, 'tốt'),
(133, 'KQ133', 'CD0133', 9, 6, 'tốt'),
(134, 'KQ134', 'CD0134', 9, 6, 'tốt'),
(135, 'KQ135', 'CD0135', 9, 6, 'tốt'),
(136, 'KQ136', 'CD0136', 9, 6, 'tốt'),
(137, 'KQ137', 'CD0137', 9, 6, 'tốt'),
(138, 'KQ138', 'CD0138', 9, 6, 'tốt'),
(139, 'KQ139', 'CD0139', 9, 6, 'tốt'),
(140, 'KQ140', 'CD0140', 9, 6, 'tốt'),
(141, 'KQ141', 'CD0141', 9, 6, 'tốt'),
(142, 'KQ142', 'CD0142', 9, 6, 'tốt'),
(143, 'KQ143', 'CD0143', 9, 6, 'tốt'),
(144, 'KQ144', 'CD0144', 9, 5, 'khá'),
(145, 'KQ145', 'CD0145', 9, 5, 'khá'),
(146, 'KQ146', 'CD0146', 9, 5, 'khá'),
(147, 'KQ147', 'CD0147', 9, 5, 'khá'),
(148, 'KQ148', 'CD0148', 9, 5, 'khá'),
(149, 'KQ149', 'CD0149', 9, 5, 'khá'),
(150, 'KQ150', 'CD0150', 9, 5, 'khá'),
(151, 'KQ151', 'CD0151', 9, 8, 'tốt'),
(152, 'KQ152', 'CD0152', 9, 8, 'tốt'),
(153, 'KQ153', 'CD0153', 9, 8, 'tốt'),
(154, 'KQ154', 'CD0154', 9, 8, 'tốt'),
(155, 'KQ155', 'CD0155', 9, 9, 'tốt'),
(156, 'KQ156', 'CD0156', 9, 9, 'tốt'),
(157, 'KQ157', 'CD0157', 9, 10, 'tốt'),
(158, 'KQ158', 'CD0158', 9, 10, 'tốt'),
(159, 'KQ159', 'CD0159', 9, 10, 'tốt'),
(160, 'KQ160', 'CD0160', 9, 10, 'tốt'),
(161, 'KQ161', 'CD0161', 10, 10, 'tốt'),
(162, 'KQ162', 'CD0162', 10, 10, 'tốt'),
(163, 'KQ163', 'CD0163', 10, 10, 'tốt'),
(164, 'KQ164', 'CD0164', 10, 10, 'tốt'),
(165, 'KQ165', 'CD0165', 5, 7, 'khá'),
(166, 'KQ166', 'CD0166', 5, 7, 'khá'),
(167, 'KQ167', 'CD0167', 5, 7, 'khá'),
(168, 'KQ168', 'CD0168', 5, 7, 'khá'),
(169, 'KQ169', 'CD0169', 5, 7, 'khá'),
(170, 'KQ170', 'CD0170', 5, 7, 'khá'),
(171, 'KQ171', 'CD0171', 5, 7, 'khá'),
(172, 'KQ172', 'CD0172', 5, 7, 'khá'),
(173, 'KQ173', 'CD0173', 5, 7, 'khá'),
(174, 'KQ174', 'CD0174', 5, 7, 'khá'),
(175, 'KQ175', 'CD0175', 5, 7, 'khá'),
(176, 'KQ176', 'CD0176', 5, 7, 'khá'),
(177, 'KQ177', 'CD0177', 5, 7, 'khá'),
(178, 'KQ178', 'CD0178', 5, 7, 'khá'),
(179, 'KQ179', 'CD0179', 4, 8, 'khá'),
(180, 'KQ180', 'CD0180', 4, 8, 'khá'),
(181, 'KQ181', 'CD0181', 4, 8, 'khá'),
(182, 'KQ182', 'CD0182', 4, 8, 'khá'),
(183, 'KQ183', 'CD0183', 4, 8, 'khá'),
(184, 'KQ184', 'CD0184', 4, 8, 'khá'),
(185, 'KQ185', 'CD0185', 4, 8, 'khá'),
(186, 'KQ186', 'CD0186', 4, 8, 'khá'),
(187, 'KQ187', 'CD0187', 4, 8, 'khá'),
(188, 'KQ188', 'CD0188', 4, 8, 'khá'),
(189, 'KQ189', 'CD0189', 4, 8, 'khá'),
(190, 'KQ190', 'CD0190', 7, 9, 'tốt'),
(191, 'KQ191', 'CD0191', 7, 9, 'tốt'),
(192, 'KQ192', 'CD0192', 7, 9, 'tốt'),
(193, 'KQ193', 'CD0193', 7, 9, 'tốt'),
(194, 'KQ194', 'CD0194', 7, 9, 'tốt'),
(195, 'KQ195', 'CD0195', 7, 9, 'tốt'),
(196, 'KQ196', 'CD0196', 7, 9, 'tốt'),
(197, 'KQ197', 'CD0197', 7, 9, 'tốt'),
(198, 'KQ198', 'CD0198', 7, 9, 'tốt'),
(199, 'KQ199', 'CD0199', 7, 9, 'tốt'),
(200, 'KQ200', 'CD0200', 7, 9, 'tốt'),
(201, 'KQ201', 'CD0201', 7, 9, 'tốt'),
(202, 'KQ202', 'CD0202', 7, 9, 'tốt'),
(203, 'KQ203', 'CD0203', 6, 2, 'khá'),
(204, 'KQ204', 'CD0204', 6, 2, 'khá'),
(205, 'KQ205', 'CD0205', 6, 2, 'khá'),
(206, 'KQ206', 'CD0206', 6, 2, 'khá'),
(207, 'KQ207', 'CD0207', 6, 2, 'khá'),
(208, 'KQ208', 'CD0208', 6, 2, 'khá'),
(209, 'KQ209', 'CD0209', 6, 2, 'khá'),
(210, 'KQ210', 'CD0210', 6, 2, 'khá'),
(211, 'KQ211', 'CD0211', 6, 2, 'khá'),
(212, 'KQ212', 'CD0212', 6, 2, 'khá'),
(213, 'KQ213', 'CD0213', 6, 2, 'khá'),
(214, 'KQ214', 'CD0214', 6, 2, 'khá'),
(215, 'KQ215', 'CD0215', 6, 2, 'khá'),
(216, 'KQ216', 'CD0216', 6, 2, 'khá'),
(217, 'KQ217', 'CD0217', 9, 3, 'khá'),
(218, 'KQ218', 'CD0218', 9, 3, 'khá'),
(219, 'KQ219', 'CD0219', 9, 3, 'khá'),
(220, 'KQ220', 'CD0220', 9, 3, 'khá'),
(221, 'KQ221', 'CD0221', 9, 3, 'khá'),
(222, 'KQ222', 'CD0222', 9, 3, 'khá'),
(223, 'KQ223', 'CD0223', 9, 3, 'khá'),
(224, 'KQ224', 'CD0224', 9, 3, 'khá'),
(225, 'KQ225', 'CD0225', 9, 3, 'khá'),
(226, 'KQ226', 'CD0226', 9, 3, 'khá'),
(227, 'KQ227', 'CD0227', 9, 3, 'khá'),
(228, 'KQ228', 'CD0228', 9, 3, 'khá'),
(229, 'KQ229', 'CD0229', 9, 3, 'khá'),
(230, 'KQ230', 'CD0230', 9, 3, 'khá'),
(231, 'KQ231', 'CD0231', 10, 7, 'tốt'),
(232, 'KQ232', 'CD0232', 10, 7, 'tốt'),
(233, 'KQ233', 'CD0233', 10, 7, 'tốt'),
(234, 'KQ234', 'CD0234', 10, 7, 'tốt'),
(235, 'KQ235', 'CD0235', 10, 7, 'tốt'),
(236, 'KQ236', 'CD0236', 10, 7, 'tốt'),
(237, 'KQ237', 'CD0237', 10, 7, 'tốt'),
(238, 'KQ238', 'CD0238', 10, 7, 'tốt'),
(239, 'KQ239', 'CD0239', 10, 7, 'tốt'),
(240, 'KQ240', 'CD0240', 10, 7, 'tốt'),
(241, 'KQ241', 'CD0241', 10, 7, 'tốt'),
(242, 'KQ242', 'CD0242', 10, 7, 'tốt'),
(243, 'KQ243', 'CD0243', 10, 7, 'tốt'),
(244, 'KQ244', 'CD0244', 4, 9, 'khá'),
(245, 'KQ245', 'CD0245', 4, 9, 'khá'),
(246, 'KQ246', 'CD0246', 4, 9, 'khá'),
(247, 'KQ247', 'CD0247', 4, 9, 'khá'),
(248, 'KQ248', 'CD0248', 4, 9, 'khá'),
(249, 'KQ249', 'CD0249', 4, 9, 'khá'),
(250, 'KQ250', 'CD0250', 4, 9, 'khá'),
(251, 'KQ251', 'CD0251', 4, 9, 'khá'),
(252, 'KQ252', 'CD0252', 4, 9, 'khá'),
(253, 'KQ253', 'CD0253', 4, 9, 'khá'),
(254, 'KQ254', 'CD0254', 4, 9, 'khá'),
(255, 'KQ255', 'CD0255', 8, 6, 'tốt'),
(256, 'KQ256', 'CD0256', 8, 6, 'tốt'),
(257, 'KQ257', 'CD0257', 8, 6, 'tốt'),
(258, 'KQ258', 'CD0258', 8, 6, 'tốt'),
(259, 'KQ259', 'CD0259', 8, 6, 'tốt'),
(260, 'KQ260', 'CD0260', 8, 6, 'tốt'),
(261, 'KQ261', 'CD0261', 8, 6, 'tốt'),
(262, 'KQ262', 'CD0262', 8, 6, 'tốt'),
(263, 'KQ263', 'CD0263', 8, 6, 'tốt'),
(264, 'KQ264', 'CD0264', 8, 6, 'tốt'),
(265, 'KQ265', 'CD0265', 5, 9, 'khá'),
(266, 'KQ266', 'CD0266', 5, 9, 'khá'),
(267, 'KQ267', 'CD0267', 5, 9, 'khá'),
(268, 'KQ268', 'CD0268', 5, 9, 'khá'),
(269, 'KQ269', 'CD0269', 5, 9, 'khá'),
(270, 'KQ270', 'CD0270', 5, 9, 'khá'),
(271, 'KQ271', 'CD0271', 5, 9, 'khá'),
(272, 'KQ272', 'CD0272', 5, 9, 'khá'),
(273, 'KQ273', 'CD0273', 5, 9, 'khá'),
(274, 'KQ274', 'CD0274', 5, 9, 'khá'),
(275, 'KQ275', 'CD0275', 3, 5, 'khá'),
(276, 'KQ276', 'CD0276', 3, 5, 'khá'),
(277, 'KQ277', 'CD0277', 3, 5, 'khá'),
(278, 'KQ278', 'CD0278', 3, 5, 'khá'),
(279, 'KQ279', 'CD0279', 3, 5, 'khá'),
(280, 'KQ280', 'CD0280', 3, 5, 'khá'),
(281, 'KQ281', 'CD0281', 3, 5, 'khá'),
(282, 'KQ282', 'CD0282', 3, 5, 'khá'),
(283, 'KQ283', 'CD0283', 3, 5, 'khá'),
(284, 'KQ284', 'CD0284', 3, 5, 'khá'),
(285, 'KQ285', 'CD0285', 3, 5, 'khá'),
(286, 'KQ286', 'CD0286', 3, 5, 'khá'),
(287, 'KQ287', 'CD0287', 3, 5, 'khá'),
(288, 'KQ288', 'CD0288', 3, 5, 'khá'),
(289, 'KQ289', 'CD0289', 3, 5, 'khá'),
(290, 'KQ290', 'CD0290', 3, 5, 'khá'),
(291, 'KQ291', 'CD0291', 3, 5, 'khá'),
(292, 'KQ292', 'CD0292', 3, 5, 'khá'),
(293, 'KQ293', 'CD0293', 3, 8, 'khá'),
(294, 'KQ294', 'CD0294', 3, 8, 'khá'),
(295, 'KQ295', 'CD0295', 6, 8, 'tốt'),
(296, 'KQ296', 'CD0296', 6, 8, 'tốt'),
(297, 'KQ297', 'CD0297', 6, 8, 'tốt'),
(298, 'KQ298', 'CD0298', 6, 8, 'tốt'),
(299, 'KQ299', 'CD0299', 6, 8, 'tốt'),
(300, 'KQ300', 'CD0300', 6, 8, 'tốt'),
(301, 'KQ301', 'CD0301', 6, 8, 'tốt'),
(302, 'KQ302', 'CD0302', 6, 8, 'tốt'),
(303, 'KQ303', 'CD0303', 6, 8, 'tốt'),
(304, 'KQ304', 'CD0304', 6, 8, 'tốt'),
(305, 'KQ305', 'CD0305', 6, 8, 'tốt'),
(306, 'KQ306', 'CD0306', 6, 8, 'tốt'),
(307, 'KQ307', 'CD0307', 6, 8, 'tốt'),
(308, 'KQ308', 'CD0308', 6, 8, 'tốt'),
(309, 'KQ309', 'CD0309', 6, 8, 'tốt'),
(310, 'KQ310', 'CD0310', 6, 8, 'tốt'),
(311, 'KQ311', 'CD0311', 6, 8, 'tốt'),
(312, 'KQ312', 'CD0312', 5, 7, 'khá'),
(313, 'KQ313', 'CD0313', 5, 7, 'khá'),
(314, 'KQ314', 'CD0314', 5, 7, 'khá'),
(315, 'KQ315', 'CD0315', 5, 7, 'khá'),
(316, 'KQ316', 'CD0316', 5, 7, 'khá'),
(317, 'KQ317', 'CD0317', 5, 7, 'khá'),
(318, 'KQ318', 'CD0318', 5, 7, 'khá'),
(319, 'KQ319', 'CD0319', 5, 7, 'khá'),
(320, 'KQ320', 'CD0320', 5, 7, 'khá'),
(321, 'KQ321', 'CD0321', 5, 7, 'khá'),
(322, 'KQ322', 'CD0322', 5, 7, 'khá'),
(323, 'KQ323', 'CD0323', 5, 7, 'khá'),
(324, 'KQ324', 'CD0324', 5, 7, 'khá'),
(325, 'KQ325', 'CD0325', 5, 7, 'khá'),
(326, 'KQ326', 'CD0326', 5, 7, 'khá'),
(327, 'KQ327', 'CD0327', 5, 7, 'khá'),
(328, 'KQ328', 'CD0328', 8, 1, 'khá'),
(329, 'KQ329', 'CD0329', 8, 1, 'khá'),
(330, 'KQ330', 'CD0330', 8, 1, 'khá'),
(331, 'KQ331', 'CD0331', 8, 1, 'khá'),
(332, 'KQ332', 'CD0332', 8, 1, 'khá'),
(333, 'KQ333', 'CD0333', 8, 1, 'khá'),
(334, 'KQ334', 'CD0334', 8, 1, 'khá'),
(335, 'KQ335', 'CD0335', 8, 1, 'khá'),
(336, 'KQ336', 'CD0336', 8, 1, 'khá'),
(337, 'KQ337', 'CD0337', 8, 1, 'khá'),
(338, 'KQ338', 'CD0338', 8, 1, 'khá'),
(339, 'KQ339', 'CD0339', 8, 1, 'khá'),
(340, 'KQ340', 'CD0340', 8, 1, 'khá'),
(341, 'KQ341', 'CD0341', 8, 1, 'khá'),
(342, 'KQ342', 'CD0342', 8, 1, 'khá'),
(343, 'KQ343', 'CD0343', 2, 10, 'khá'),
(344, 'KQ344', 'CD0344', 2, 10, 'khá'),
(345, 'KQ345', 'CD0345', 2, 10, 'khá'),
(346, 'KQ346', 'CD0346', 2, 10, 'khá'),
(347, 'KQ347', 'CD0347', 2, 10, 'khá'),
(348, 'KQ348', 'CD0348', 2, 10, 'khá'),
(349, 'KQ349', 'CD0349', 2, 10, 'khá'),
(350, 'KQ350', 'CD0350', 2, 10, 'khá'),
(351, 'KQ351', 'CD0351', 2, 10, 'khá'),
(352, 'KQ352', 'CD0352', 2, 10, 'khá'),
(353, 'KQ353', 'CD0353', 2, 10, 'khá'),
(354, 'KQ354', 'CD0354', 2, 10, 'khá'),
(355, 'KQ355', 'CD0355', 2, 10, 'khá'),
(356, 'KQ356', 'CD0356', 2, 10, 'khá'),
(357, 'KQ357', 'CD0357', 2, 10, 'khá'),
(358, 'KQ358', 'CD0358', 2, 10, 'khá'),
(359, 'KQ359', 'CD0359', 2, 10, 'khá'),
(360, 'KQ360', 'CD0360', 2, 10, 'khá'),
(361, 'KQ361', 'CD0361', 2, 10, 'khá'),
(362, 'KQ362', 'CD0362', 2, 10, 'khá'),
(363, 'KQ363', 'CD0363', 2, 10, 'khá'),
(364, 'KQ364', 'CD0364', 5, 9, 'khá'),
(365, 'KQ365', 'CD0365', 5, 9, 'khá'),
(366, 'KQ366', 'CD0366', 5, 9, 'khá'),
(367, 'KQ367', 'CD0367', 5, 9, 'khá'),
(368, 'KQ368', 'CD0368', 5, 9, 'khá'),
(369, 'KQ369', 'CD0369', 5, 9, 'khá'),
(370, 'KQ370', 'CD0370', 5, 9, 'khá'),
(371, 'KQ371', 'CD0371', 5, 9, 'khá'),
(372, 'KQ372', 'CD0372', 5, 9, 'khá'),
(373, 'KQ373', 'CD0373', 5, 9, 'khá'),
(374, 'KQ374', 'CD0374', 5, 9, 'khá'),
(375, 'KQ375', 'CD0375', 5, 9, 'khá'),
(376, 'KQ376', 'CD0376', 5, 9, 'khá'),
(377, 'KQ377', 'CD0377', 5, 9, 'khá'),
(378, 'KQ378', 'CD0378', 5, 9, 'khá'),
(379, 'KQ379', 'CD0379', 5, 9, 'khá'),
(380, 'KQ380', 'CD0380', 5, 9, 'khá'),
(381, 'KQ381', 'CD0381', 7, 8, 'tốt'),
(382, 'KQ382', 'CD0382', 7, 8, 'tốt'),
(383, 'KQ383', 'CD0383', 7, 8, 'tốt'),
(384, 'KQ384', 'CD0384', 7, 8, 'tốt'),
(385, 'KQ385', 'CD0385', 7, 8, 'tốt'),
(386, 'KQ386', 'CD0386', 7, 8, 'tốt'),
(387, 'KQ387', 'CD0387', 7, 8, 'tốt'),
(388, 'KQ388', 'CD0388', 7, 8, 'tốt'),
(389, 'KQ389', 'CD0389', 7, 8, 'tốt'),
(390, 'KQ390', 'CD0390', 7, 8, 'tốt'),
(391, 'KQ391', 'CD0391', 7, 8, 'tốt'),
(392, 'KQ392', 'CD0392', 7, 8, 'tốt'),
(393, 'KQ393', 'CD0393', 7, 8, 'tốt'),
(394, 'KQ394', 'CD0394', 7, 8, 'tốt'),
(395, 'KQ395', 'CD0395', 7, 8, 'tốt'),
(396, 'KQ396', 'CD0396', 7, 8, 'tốt'),
(397, 'KQ397', 'CD0397', 7, 8, 'tốt'),
(398, 'KQ398', 'CD0398', 7, 8, 'tốt'),
(399, 'KQ399', 'CD0399', 6, 3, 'khá'),
(400, 'KQ400', 'CD0400', 6, 3, 'khá'),
(401, 'KQ401', 'CD0401', 6, 1, 'khá'),
(402, 'KQ402', 'CD0402', 6, 4, 'khá'),
(403, 'KQ403', 'CD0403', 6, 8, 'tốt'),
(404, 'KQ404', 'CD0404', 6, 8, 'tốt'),
(405, 'KQ405', 'CD0405', 6, 8, 'tốt'),
(406, 'KQ406', 'CD0406', 6, 7, 'tốt'),
(407, 'KQ407', 'CD0407', 6, 7, 'tốt'),
(408, 'KQ408', 'CD0408', 6, 7, 'tốt'),
(409, 'KQ409', 'CD0409', 6, 7, 'tốt'),
(410, 'KQ410', 'CD0410', 6, 7, 'tốt'),
(411, 'KQ411', 'CD0411', 6, 6, 'tốt'),
(412, 'KQ412', 'CD0412', 6, 6, 'tốt'),
(413, 'KQ413', 'CD0413', 6, 6, 'tốt'),
(414, 'KQ414', 'CD0414', 6, 6, 'tốt'),
(415, 'KQ415', 'CD0415', 9, 10, 'tốt'),
(416, 'KQ416', 'CD0416', 9, 10, 'tốt'),
(417, 'KQ417', 'CD0417', 9, 10, 'tốt'),
(418, 'KQ418', 'CD0418', 10, 10, 'tốt'),
(419, 'KQ419', 'CD0419', 10, 10, 'tốt'),
(420, 'KQ420', 'CD0420', 10, 10, 'tốt');

-- --------------------------------------------------------

--
-- Table structure for table `GIAOVIEN`
--

CREATE TABLE `GIAOVIEN` (
  `id` int(11) NOT NULL,
  `magv` varchar(10) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `tengv` varchar(30) COLLATE utf8_unicode_ci NOT NULL,
  `mamon` varchar(10) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `tenmon` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  `sodt` int(10) DEFAULT NULL,
  `makhoa` varchar(10) COLLATE utf8_unicode_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Dumping data for table `GIAOVIEN`
--

INSERT INTO `GIAOVIEN` (`id`, `magv`, `tengv`, `mamon`, `tenmon`, `sodt`, `makhoa`) VALUES
(1, 'GV001', 'Nguyễn Gia Huy', 'MH001', 'Chính trị', 123456788, 'KCB'),
(2, 'GV002', 'Võ Thị Hồng', 'MH002', 'Pháp luật', 123456790, 'KCB'),
(3, 'GV003', 'Trần Anh Tuấn', 'MH003', 'Toán cao cấp', 123456791, 'KCB'),
(4, 'GV004', 'Bùi Thị Vân', 'MH004', 'Tin học căn bản', 123456792, 'KCB'),
(5, 'GV005', 'Ninh Thu Hà', 'MH005', 'Anh văn 1', 123456793, 'KCB'),
(6, 'GV006', 'Trịnh Văn Nam', 'MH006', 'Giáo dục quốc phòng', 123456794, 'KCB'),
(7, 'GV007', 'Bùi Việt Vương', 'MH007', 'Giáo dục thể chất', 123456795, 'KCB'),
(8, 'GV005', 'Ninh Thu Hà', 'MH008', 'Anh văn 2', 123456796, 'CNTT'),
(9, 'GV008', 'Nguyễn Hải Yến', 'MH009', 'Bảng tính Excel', 123456797, 'CNTT'),
(10, 'GV004', 'Bùi Thị Vân', 'MH010', 'Lập trình căn bản', 123456798, 'CNTT'),
(11, 'GV009', 'Bùi Thị Hòa', 'MH011', 'Kỹ năng mềm', 123456799, 'CNTT'),
(12, 'GV010', 'Đàm Truyền Đức', 'MH012', 'Mạng máy tính', 123456800, 'CNTT'),
(13, 'GV011', 'Nguyễn Viết Cường', 'MH013', 'Cấu trúc máy tính', 123456801, 'CNTT'),
(14, 'GV008', 'Nguyễn Hải Yến', 'MH014', 'Hệ QTCSDL SQL Server', 123456802, 'CNTT'),
(15, 'GV012', 'Lê Diệu Linh', 'MH015', 'Anh văn chuyên ngành 1', 123456803, 'CNTT'),
(16, 'GV013', 'Nguyễn Phương Thảo', 'MH016', 'Cơ sở dữ liệu', 123456804, 'CNTT'),
(17, 'GV010', 'Đàm Truyền Đức', 'MH017', 'Quản trị mạng Windows', 123456805, 'CNTT'),
(18, 'GV014', 'Đỗ Văn Uy', 'MH018', 'Cấu trúc dữ liệu và giải thuật', 123456806, 'CNTT'),
(19, 'GV015', 'Lương Mạnh Bá', 'MH019', 'Lập trình hướng đối tượng', 123456807, 'CNTT'),
(20, 'GV016', 'Lưu Tiến Lợi', 'MH020', 'Đồ họa ứng dụng', 123456808, 'CNTT'),
(21, 'GV017', 'Nguyễn Hoài Linh', 'MH021', 'Thực tập nhận thức', 123456809, 'CNTT'),
(22, 'GV018', 'Nguyễn Ánh Tuyết', 'MH022', 'Anh văn chuyên ngành 2', 123456810, 'CNTT'),
(23, 'GV010', 'Đàm Truyền Đức', 'MH023', 'Thiết kế, xây dựng mạng LAN', 123456811, 'CNTT'),
(24, 'GV009', 'Bùi Thị Hòa', 'MH024', 'Lập trình C#', 123456812, 'CNTT'),
(25, 'GV014', 'Đỗ Văn Uy', 'MH025', 'Bảo trì hệ thống', 123456813, 'CNTT'),
(26, 'GV019', 'Nguyễn Hồng Hạnh', 'MH026', 'Phân tích thiết kế hệ thống', 123456814, 'CNTT'),
(27, 'GV004', 'Bùi Thị Vân', 'MH027', 'Xây dựng Website', 123456815, 'CNTT'),
(28, 'GV017', 'Nguyễn Hoài Linh', 'MH028', 'Thực tập nghề nghiệp', 123456816, 'CNTT'),
(29, 'GV014', 'Đỗ Văn Uy', 'MH029', 'An toàn bảo mật thông tin', 123456817, 'CNTT'),
(30, 'GV020', 'Nguyễn Thanh Tùng', 'MH030', 'Xây dựng Website bằng PMMNM', 123456818, 'CNTT'),
(31, 'GV021', 'Hà Thị Hương', 'MH031', 'Tổ chức quản lý doanh nghiệp', 123456819, 'CNTT'),
(32, 'GV022', 'Nguyễn Thị Hoa', 'MH032', 'Công nghệ phần mềm', 123456820, 'CNTT'),
(33, 'GV015', 'Lương Mạnh Bá', 'MH033', 'Quản lý dự án CNTT', 123456821, 'CNTT'),
(34, 'GV022', 'Nguyễn Thị Hoa', 'MH034', 'Xây dựng phần mềm quản lý', 123456822, 'CNTT'),
(35, 'GV017', 'Nguyễn Hoài Linh', 'MH035', 'Thực tập tốt nghiệp', 123456823, 'CNTT'),
(36, 'GV017', 'Nguyễn Hoài Linh', 'MH036', 'Đồ án/ Thi tốt nghiệp', 123456824, 'CNTT'),
(37, 'GV016', 'Lưu Tiến Lợi', 'MH037', 'Vẽ kỹ thuật và AutoCAD', 123456825, 'KCK'),
(38, 'GV023', 'Đào Minh Tuấn', 'MH038', 'Dung sai và kỹ thuật đo', 123456826, 'KCK'),
(39, 'GV023', 'Đào Minh Tuấn', 'MH039', 'Kỹ thuật điện', 123456827, 'KCK'),
(40, 'GV023', 'Đào Minh Tuấn', 'MH040', 'Kỹ thuật điện tử', 123456828, 'KCK'),
(41, 'GV023', 'Đào Minh Tuấn', 'MH041', 'Kỹ thuật nhiệt', 123456829, 'KCK'),
(42, 'GV024', 'Hoàng Quốc Tuấn', 'MH042', 'Cơ lý thuyết', 123456830, 'KCK'),
(43, 'GV016', 'Lưu Tiến Lợi', 'MH043', 'Vẽ kỹ thuật 2', 123456831, 'KCK'),
(44, 'GV024', 'Hoàng Quốc Tuấn', 'MH044', 'Nguyên lý, chi tiết máy', 123456832, 'KCK'),
(45, 'GV024', 'Hoàng Quốc Tuấn', 'MH045', 'Sức bền, vật liệu', 123456833, 'KCK'),
(46, 'GV025', 'Vũ Văn Quân', 'MH046', 'Kỹ thuật an toàn & BHLD', 123456834, 'KCK'),
(47, 'GV025', 'Vũ Văn Quân', 'MH047', 'Tổ chức và quản lý sản xuất', 123456835, 'KCK'),
(48, 'GV024', 'Hoàng Quốc Tuấn', 'MH048', 'Cơ khí đại cương và VL cơ khí', 123456836, 'KCK'),
(49, 'GV026', 'Nguyễn Văn Tấn', 'MH049', 'Nguyên lý cắt và dụng cụ cắt', 123456837, 'KCK'),
(50, 'GV026', 'Nguyễn Văn Tấn', 'MH050', 'Máy công cụ', 123456838, 'KCK'),
(51, 'GV026', 'Nguyễn Văn Tấn', 'MH051', 'Công nghệ chế tạo máy', 123456839, 'KCK'),
(52, 'GV027', 'Lê Văn Lộc', 'MH052', 'Kỹ thuật tiện', 123456840, 'KCK'),
(53, 'GV027', 'Lê Văn Lộc', 'MH053', 'Kỹ thuật phay', 123456841, 'KCK'),
(54, 'GV027', 'Lê Văn Lộc', 'MH054', 'Đồ gá', 123456842, 'KCK'),
(55, 'GV028', 'Trịnh Việt Long', 'MH055', 'Công nghệ gia công áp lực', 123456843, 'KCK'),
(56, 'GV028', 'Trịnh Việt Long', 'MH056', 'Công nghệ CNC', 123456844, 'KCK'),
(57, 'GV028', 'Trịnh Việt Long', 'MH057', 'Robot công nghiệp', 123456845, 'KCK'),
(58, 'GV029', 'Nguyễn Xuân Mạnh', 'MH058', 'Truyền động khí nén thủy lực', 123456846, 'KCK'),
(59, 'GV029', 'Nguyễn Xuân Mạnh', 'MH059', 'Thiết kế quy trình công nghệ', 123456847, 'KCK'),
(60, 'GV029', 'Nguyễn Xuân Mạnh', 'MH060', 'Tính toán thiết kế một số cụm TD', 123456848, 'KCK'),
(61, 'GV030', 'Nguyễn Văn Đồng', 'MH061', 'Kỹ thuật CAD/CAM', 123456849, 'KCK'),
(62, 'GV030', 'Nguyễn Văn Đồng', 'MH062', 'Hệ thống FMS/CIM', 123456850, 'KCK'),
(63, 'GV012', 'Lê Diệu Linh', 'MH063', 'Anh văn chuyên ngành', 123456851, 'KCK'),
(64, 'GV014', 'Đỗ Văn Uy', 'MH064', 'Thực tập tốt nghiệp', 123456852, 'KCK'),
(65, 'GV014', 'Đỗ Văn Uy', 'MH065', 'Thực tập nhận thức', 123456853, 'KCK'),
(66, 'GV031', 'Nguyễn Đức Tiến', 'MH066', 'Kỹ thuật bào và xọc', 123456854, 'KCK'),
(67, 'GV031', 'Nguyễn Đức Tiến', 'MH067', 'Kỹ thuật mài', 123456855, 'KCK'),
(68, 'GV031', 'Nguyễn Đức Tiến', 'MH068', 'Kỹ thuật gia công bánh răng', 123456856, 'KCK'),
(69, 'GV014', 'Đỗ Văn Uy', 'MH069', 'Thực tập nghề nghiệp', 123456857, 'KCK'),
(70, 'GV031', 'Nguyễn Đức Tiến', 'MH070', 'Kỹ thuật hàn', 123456858, 'KCK'),
(71, 'GV014', 'Đỗ Văn Uy', 'MH071', 'Đồ án tốt nghiệp', 123456859, 'KCK'),
(72, 'GV032', 'Lê Văn Tuấn', 'MH072', 'Nhập môn điện và điện lạnh', 123456860, 'ĐBDCN'),
(73, 'GV032', 'Lê Văn Tuấn', 'MH073', 'Lý thuyết mạch điện', 123456861, 'ĐBDCN'),
(74, 'GV032', 'Lê Văn Tuấn', 'MH074', 'Vẽ kỹ thuật', 123456862, 'ĐBDCN'),
(75, 'GV033', 'Nguyễn Văn Thăng', 'MH075', 'Kỹ thuật điện tử', 123456863, 'ĐBDCN'),
(76, 'GV033', 'Nguyễn Văn Thăng', 'MH076', 'Vẽ điện', 123456864, 'ĐBDCN'),
(77, 'GV033', 'Nguyễn Văn Thăng', 'MH077', 'Kỹ thuật cơ khí', 123456865, 'ĐBDCN'),
(78, 'GV034', 'Lê Xuân Tú', 'MH078', 'Vật liệu điện & an toàn điện', 123456866, 'ĐBDCN'),
(79, 'GV034', 'Lê Xuân Tú', 'MH079', 'Đo lường - cảm biến', 123456867, 'ĐBDCN'),
(80, 'GV034', 'Lê Xuân Tú', 'MH080', 'Kỹ thuật thủy khí', 123456868, 'ĐBDCN'),
(81, 'GV035', 'Hoàng Ngọc Minh', 'MH081', 'Anh văn chuyên ngành', 123456869, 'ĐBDCN'),
(82, 'GV035', 'Hoàng Ngọc Minh', 'MH082', 'Kỹ thuật nhiệt - lạnh', 123456870, 'ĐBDCN'),
(83, 'GV035', 'Hoàng Ngọc Minh', 'MH083', 'Máy điện', 123456871, 'ĐBDCN'),
(84, 'GV036', 'Trương Ngọc Oai', 'MH084', 'Khí cụ điện', 123456872, 'ĐBDCN'),
(85, 'GV036', 'Trương Ngọc Oai', 'MH085', 'Điện từ công suất', 123456873, 'ĐBDCN'),
(86, 'GV036', 'Trương Ngọc Oai', 'MH086', 'Thực tập nhận thức', 123456874, 'ĐBDCN'),
(87, 'GV037', 'Lê Đức Giang', 'MH087', 'Kỹ thuật lắp đặt điện', 123456875, 'ĐBDCN'),
(88, 'GV037', 'Lê Đức Giang', 'MH088', 'Kỹ thuật xung - số', 123456876, 'ĐBDCN'),
(89, 'GV037', 'Lê Đức Giang', 'MH089', 'Cung cấp điện', 123456877, 'ĐBDCN'),
(90, 'GV038', 'Nguyễn Thùy Linh', 'MH090', 'PLC', 123456878, 'ĐBDCN'),
(91, 'GV038', 'Nguyễn Thùy Linh', 'MH091', 'Truyền động điện', 123456879, 'ĐBDCN'),
(92, 'GV038', 'Nguyễn Thùy Linh', 'MH092', 'Thực tập nghề nghiệp', 123456880, 'ĐBDCN'),
(93, 'GV039', 'Nguyễn Văn Đức', 'MH093', 'Thiết bị điện dân dụng', 123456881, 'ĐBDCN'),
(94, 'GV039', 'Nguyễn Văn Đức', 'MH094', 'SCADA và Mạng truyền thông CN', 123456882, 'ĐBDCN'),
(95, 'GV039', 'Nguyễn Văn Đức', 'MH095', 'Tổ chức sản xuất', 123456883, 'ĐBDCN'),
(96, 'GV040', 'Hà Duy Mạnh', 'MH096', 'Trang bị điện', 123456884, 'ĐBDCN'),
(97, 'GV040', 'Hà Duy Mạnh', 'MH097', 'Kỹ thuật vi điều khiển', 123456885, 'ĐBDCN'),
(98, 'GV040', 'Hà Duy Mạnh', 'MH098', 'Điều khiển thông minh', 123456886, 'ĐBDCN'),
(99, 'GV041', 'Nguyễn Thị Tuyến', 'MH099', 'Thực tập tốt nghiệp', 123456887, 'ĐBDCN'),
(100, 'GV041', 'Nguyễn Thị Tuyến', 'MH100', 'Đồ án/ Thi tốt nghiệp', 123456888, 'ĐBDCN'),
(101, 'GV041', 'Nguyễn Thị Tuyến', 'MH101', 'Nhập môn điện tử công nghiệp', 123456889, 'ĐTVT'),
(102, 'GV042', 'Nguyễn Trọng Huỳnh', 'MH102', 'Cấu kiện điện tử', 123456890, 'ĐTVT'),
(103, 'GV042', 'Nguyễn Trọng Huỳnh', 'MH103', 'Đo lường điện tử', 123456891, 'ĐTVT'),
(104, 'GV042', 'Nguyễn Trọng Huỳnh', 'MH104', 'Kỹ thuật điện', 123456892, 'ĐTVT'),
(105, 'GV043', 'Nguyễn Thị Thùy', 'MH105', 'Kỹ thuật cơ khí', 123456893, 'ĐTVT'),
(106, 'GV043', 'Nguyễn Thị Thùy', 'MH106', 'Kỹ thuật mạch điện tử I', 123456894, 'ĐTVT'),
(107, 'GV043', 'Nguyễn Thị Thùy', 'MH107', 'Vẽ mạch điện tử', 123456895, 'ĐTVT'),
(108, 'GV044', 'Lê Thị Mến', 'MH108', 'Công nghệ chế tạo mạch in', 123456896, 'ĐTVT'),
(109, 'GV044', 'Lê Thị Mến', 'MH109', 'Kỹ thuật số 1', 123456897, 'ĐTVT'),
(110, 'GV044', 'Lê Thị Mến', 'MH110', 'Khí cụ điện và an toàn điện', 123456898, 'ĐTVT'),
(111, 'GV045', 'Nguyễn Ngọc Ánh', 'MH111', 'Tiếng Anh chuyên ngành', 123456899, 'ĐTVT'),
(112, 'GV045', 'Nguyễn Ngọc Ánh', 'MH112', 'Kỹ thuật số 2', 123456900, 'ĐTVT'),
(113, 'GV045', 'Nguyễn Ngọc Ánh', 'MH113', 'Kỹ thuật mạch điện tử II', 123456901, 'ĐTVT'),
(114, 'GV001', 'Nguyễn Gia Huy', 'MH114', 'Điện tử công suất', 123456902, 'ĐTVT'),
(115, 'GV001', 'Nguyễn Gia Huy', 'MH115', 'Cơ sở thông tin số', 123456903, 'ĐTVT'),
(116, 'GV002', 'Võ Thị Hồng', 'MH116', 'Kỹ thuật vi điều khiển I', 123456904, 'ĐTVT'),
(117, 'GV002', 'Võ Thị Hồng', 'MH117', 'Kỹ thuật lập trình C', 123456905, 'ĐTVT'),
(118, 'GV046', 'Lê Ngọc Phan', 'MH118', 'Thực tập nhận thức', 123456906, 'ĐTVT'),
(119, 'GV046', 'Lê Ngọc Phan', 'MH119', 'PLC', 123456907, 'ĐTVT'),
(120, 'GV046', 'Lê Ngọc Phan', 'MH120', 'Máy điện', 123456908, 'ĐTVT'),
(121, 'GV047', 'Nguyễn Đắc Tiến', 'MH121', 'Kỹ thuật cảm biến', 123456909, 'ĐTVT'),
(122, 'GV047', 'Nguyễn Đắc Tiến', 'MH122', 'Trang bị điện', 123456910, 'ĐTVT'),
(123, 'GV047', 'Nguyễn Đắc Tiến', 'MH123', 'Kỹ thuật vi điều khiển II', 123456911, 'ĐTVT'),
(124, 'GV048', 'Nguyễn Văn Tiến', 'MH124', 'Thiết kế mạch điện tử', 123456912, 'ĐTVT'),
(125, 'GV048', 'Nguyễn Văn Tiến', 'MH125', 'Thực tập nghề nghiệp', 123456913, 'ĐTVT'),
(126, 'GV048', 'Nguyễn Văn Tiến', 'MH126', 'Điều khiển khí nén thủy khí', 123456914, 'ĐTVT'),
(127, 'GV049', 'Phạm Minh Hiếu', 'MH127', 'Quản lý DN và tổ chức sx', 123456915, 'ĐTVT'),
(128, 'GV049', 'Phạm Minh Hiếu', 'MH128', 'Kỹ thuật tự động hóa thiết bị điện', 123456916, 'ĐTVT'),
(129, 'GV049', 'Phạm Minh Hiếu', 'MH129', 'Kỹ thật robot công nghiệp', 123456917, 'ĐTVT'),
(130, 'GV050', 'Lê Văn Sáng', 'MH130', 'Kỹ thuật mạng truyền thông CN', 123456918, 'ĐTVT'),
(131, 'GV050', 'Lê Văn Sáng', 'MH131', 'Kỹ thuật truyền hình', 123456919, 'ĐTVT'),
(132, 'GV050', 'Lê Văn Sáng', 'MH132', 'Cơ sở Internet vạn vật', 123456920, 'ĐTVT'),
(133, 'GV051', 'Lê Thị Thùy', 'MH133', 'Thực tập tốt nghiệp', 123456921, 'ĐTVT'),
(134, 'GV051', 'Lê Thị Thùy', 'MH134', 'Đồ án tốt nghiệp', 123456922, 'ĐTVT'),
(135, 'GV051', 'Lê Thị Thùy', 'MH135', 'Anh văn 2', 123456923, 'KTQL'),
(136, 'GV052', 'Bùi Xuân Hà', 'MH136', 'Lý thuyết tài chính tiền tệ', 123456924, 'KTQL'),
(137, 'GV052', 'Bùi Xuân Hà', 'MH137', 'Nguyên lí kế toán', 123456925, 'KTQL'),
(138, 'GV052', 'Bùi Xuân Hà', 'MH138', 'Luật kinh doanh', 123456926, 'KTQL'),
(139, 'GV053', 'Lê Mạnh Hà', 'MH139', 'Kinh tế vi mô', 123456927, 'KTQL'),
(140, 'GV053', 'Lê Mạnh Hà', 'MH140', 'Quản trị học', 123456928, 'KTQL'),
(141, 'GV053', 'Lê Mạnh Hà', 'MH141', 'Tài chính doanh nghiệp 1', 123456929, 'KTQL'),
(142, 'GV054', 'Nguyễn Văn Oai', 'MH142', 'Anh văn chuyên ngành', 123456930, 'KTQL'),
(143, 'GV054', 'Nguyễn Văn Oai', 'MH143', 'Hệ thống thông tin quản lý', 123456931, 'KTQL'),
(144, 'GV054', 'Nguyễn Văn Oai', 'MH144', 'Marketing cơ bản', 123456932, 'KTQL'),
(145, 'GV055', 'Trần Trung Kiên', 'MH145', 'Kỹ năng mềm', 123456933, 'KTQL'),
(146, 'GV055', 'Trần Trung Kiên', 'MH146', 'Thực tập nhận thức', 123456934, 'KTQL'),
(147, 'GV055', 'Trần Trung Kiên', 'MH147', 'Tài chính doanh nghiệp 2', 123456935, 'KTQL'),
(148, 'GV056', 'Phùng Huy Hùng', 'MH148', 'Quản trị chất lượng', 123456936, 'KTQL'),
(149, 'GV056', 'Phùng Huy Hùng', 'MH189', 'Hành vi tổ chức', 123456937, 'KTQL'),
(150, 'GV056', 'Phùng Huy Hùng', 'MH150', 'Tin học ứng dụng trong KD', 123456938, 'KTQL'),
(151, 'GV057', 'Nguyễn Văn Đức', 'MH151', 'Quản trị doanh nghiệp 1', 123456939, 'KTQL'),
(152, 'GV057', 'Nguyễn Văn Đức', 'MH152', 'Quản trị dự án đầu tư', 123456940, 'KTQL'),
(153, 'GV057', 'Nguyễn Văn Đức', 'MH153', 'Quản trị nhân lực', 123456941, 'KTQL'),
(154, 'GV058', 'Nguyễn Bảo Trang', 'MH154', 'Kinh tế thương mại và dịch vụ', 123456942, 'KTQL'),
(155, 'GV058', 'Nguyễn Bảo Trang', 'MH155', 'Quản trị kinh doanh và tác nghiệp', 123456943, 'KTQL'),
(156, 'GV058', 'Nguyễn Bảo Trang', 'MH156', 'Quản trị doanh nghiệp 2', 123456944, 'KTQL'),
(157, 'GV059', 'Trần Lệ Xuân', 'MH157', 'Chiến lược và kế hoạch KD', 123456945, 'KTQL'),
(158, 'GV059', 'Trần Lệ Xuân', 'MH158', 'Kế toán quản trị', 123456946, 'KTQL'),
(159, 'GV059', 'Trần Lệ Xuân', 'MH159', 'Phân tích hoạt động kinh doanh', 123456947, 'KTQL'),
(160, 'GV060', 'Nguyễn Thị Yến', 'MH160', 'Tâm lý kinh doanh', 123456948, 'KTQL'),
(161, 'GV060', 'Nguyễn Thị Yến', 'MH161', 'Quản trị Marketing', 123456949, 'KTQL'),
(162, 'GV060', 'Nguyễn Thị Yến', 'MH162', 'Khởi nghiệp và tìm kiếm việc làm', 123456950, 'KTQL'),
(163, 'GV061', 'Trương Thế Bảo', 'MH163', 'Thực tập nghề nghiệp', 123456951, 'KTQL'),
(164, 'GV061', 'Trương Thế Bảo', 'MH164', 'Đồ án tốt nghiệp', 123456952, 'KTQL');

-- --------------------------------------------------------

--
-- Table structure for table `KETQUA`
--

CREATE TABLE `KETQUA` (
  `id` int(11) NOT NULL,
  `makq` varchar(10) COLLATE utf8mb4_unicode_ci NOT NULL,
  `mamh` varchar(10) COLLATE utf8mb4_unicode_ci NOT NULL,
  `kihoc` int(11) NOT NULL,
  `namhoc` year(4) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `KETQUA`
--

INSERT INTO `KETQUA` (`id`, `makq`, `mamh`, `kihoc`, `namhoc`) VALUES
(1, 'KQ001', '2', 2, 2017),
(2, 'KQ002', '2', 2, 2018),
(3, 'KQ003', 'MH003', 3, 2019),
(4, 'KQ004', 'MH004', 4, 2020),
(5, 'KQ005', 'MH005', 5, 2021),
(6, 'KQ006', 'MH006', 6, 2022),
(7, 'KQ007', 'MH007', 1, 2017),
(8, 'KQ008', 'MH008', 2, 2018),
(9, 'KQ009', 'MH009', 3, 2019),
(10, 'KQ010', 'MH010', 4, 2020),
(11, 'KQ011', 'MH011', 5, 2021),
(12, 'KQ012', 'MH012', 6, 2022),
(13, 'KQ013', 'MH013', 1, 2017),
(14, 'KQ014', 'MH014', 2, 2018),
(15, 'KQ015', 'MH015', 3, 2019),
(16, 'KQ016', 'MH016', 4, 2020),
(17, 'KQ017', 'MH017', 5, 2021),
(18, 'KQ018', 'MH018', 6, 2022),
(19, 'KQ019', 'MH019', 1, 2017),
(20, 'KQ020', 'MH020', 2, 2018),
(21, 'KQ021', 'MH021', 3, 2019),
(22, 'KQ022', 'MH022', 4, 2020),
(23, 'KQ023', 'MH023', 5, 2021),
(24, 'KQ024', 'MH024', 6, 2022),
(25, 'KQ025', 'MH025', 1, 2017),
(26, 'KQ026', 'MH026', 2, 2018),
(27, 'KQ027', 'MH027', 3, 2019),
(28, 'KQ028', 'MH028', 4, 2020),
(29, 'KQ029', 'MH029', 5, 2021),
(30, 'KQ030', 'MH030', 6, 2022),
(31, 'KQ031', 'MH031', 1, 2017),
(32, 'KQ032', 'MH032', 2, 2018),
(33, 'KQ033', 'MH033', 3, 2019),
(34, 'KQ034', 'MH034', 4, 2020),
(35, 'KQ035', 'MH035', 5, 2021),
(36, 'KQ036', 'MH036', 6, 2022),
(37, 'KQ037', 'MH037', 1, 2017),
(38, 'KQ038', 'MH038', 2, 2018),
(39, 'KQ039', 'MH039', 3, 2019),
(40, 'KQ040', 'MH040', 4, 2020),
(41, 'KQ041', 'MH041', 5, 2021),
(42, 'KQ042', 'MH042', 6, 2022),
(43, 'KQ043', 'MH043', 1, 2017),
(44, 'KQ044', 'MH044', 2, 2018),
(45, 'KQ045', 'MH045', 3, 2019),
(46, 'KQ046', 'MH046', 4, 2020),
(47, 'KQ047', 'MH047', 5, 2021),
(48, 'KQ048', 'MH048', 6, 2022),
(49, 'KQ049', 'MH049', 1, 2017),
(50, 'KQ050', 'MH050', 2, 2018),
(51, 'KQ051', 'MH051', 3, 2019),
(52, 'KQ052', 'MH052', 4, 2020),
(53, 'KQ053', 'MH053', 5, 2021),
(54, 'KQ054', 'MH054', 6, 2022),
(55, 'KQ055', 'MH055', 1, 2017),
(56, 'KQ056', 'MH056', 2, 2018),
(57, 'KQ057', 'MH057', 3, 2019),
(58, 'KQ058', 'MH058', 4, 2020),
(59, 'KQ059', 'MH059', 5, 2021),
(60, 'KQ060', 'MH060', 6, 2022),
(61, 'KQ061', 'MH061', 1, 2017),
(62, 'KQ062', 'MH062', 2, 2018),
(63, 'KQ063', 'MH063', 3, 2019),
(64, 'KQ064', 'MH064', 4, 2020),
(65, 'KQ065', 'MH065', 5, 2021),
(66, 'KQ066', 'MH066', 6, 2022),
(67, 'KQ067', 'MH067', 1, 2017),
(68, 'KQ068', 'MH068', 2, 2018),
(69, 'KQ069', 'MH069', 3, 2019),
(70, 'KQ070', 'MH070', 4, 2020),
(71, 'KQ071', 'MH071', 5, 2021),
(72, 'KQ072', 'MH072', 6, 2022),
(73, 'KQ073', 'MH073', 1, 2017),
(74, 'KQ074', 'MH074', 2, 2018),
(75, 'KQ075', 'MH075', 3, 2019),
(76, 'KQ076', 'MH076', 4, 2020),
(77, 'KQ077', 'MH077', 5, 2021),
(78, 'KQ078', 'MH078', 6, 2022),
(79, 'KQ079', 'MH079', 1, 2017),
(80, 'KQ080', 'MH080', 2, 2018),
(81, 'KQ081', 'MH081', 3, 2019),
(82, 'KQ082', 'MH082', 4, 2020),
(83, 'KQ083', 'MH083', 5, 2021),
(84, 'KQ084', 'MH084', 6, 2022),
(85, 'KQ085', 'MH085', 1, 2017),
(86, 'KQ086', 'MH086', 2, 2018),
(87, 'KQ087', 'MH087', 3, 2019),
(88, 'KQ088', 'MH088', 4, 2020),
(89, 'KQ089', 'MH089', 5, 2021),
(90, 'KQ090', 'MH090', 6, 2022),
(91, 'KQ091', 'MH091', 1, 2017),
(92, 'KQ092', 'MH092', 2, 2018),
(93, 'KQ093', 'MH093', 3, 2019),
(94, 'KQ094', 'MH094', 4, 2020),
(95, 'KQ095', 'MH095', 5, 2021),
(96, 'KQ096', 'MH096', 6, 2022),
(97, 'KQ097', 'MH097', 1, 2017),
(98, 'KQ098', 'MH098', 2, 2018),
(99, 'KQ099', 'MH099', 3, 2019),
(100, 'KQ100', 'MH100', 4, 2020),
(101, 'KQ101', 'MH101', 5, 2021),
(102, 'KQ102', 'MH102', 6, 2022),
(103, 'KQ103', 'MH103', 1, 2017),
(104, 'KQ104', 'MH104', 2, 2018),
(105, 'KQ105', 'MH105', 3, 2019),
(106, 'KQ106', 'MH106', 4, 2020),
(107, 'KQ107', 'MH107', 5, 2021),
(108, 'KQ108', 'MH108', 6, 2022),
(109, 'KQ109', 'MH109', 1, 2017),
(110, 'KQ110', 'MH110', 2, 2018),
(111, 'KQ111', 'MH111', 3, 2019),
(112, 'KQ112', 'MH112', 4, 2020),
(113, 'KQ113', 'MH113', 5, 2021),
(114, 'KQ114', 'MH114', 6, 2022),
(115, 'KQ115', 'MH115', 1, 2017),
(116, 'KQ116', 'MH116', 2, 2018),
(117, 'KQ117', 'MH117', 3, 2019),
(118, 'KQ118', 'MH118', 4, 2020),
(119, 'KQ119', 'MH119', 5, 2021),
(120, 'KQ120', 'MH120', 6, 2022),
(121, 'KQ121', 'MH121', 1, 2017),
(122, 'KQ122', 'MH122', 2, 2018),
(123, 'KQ123', 'MH123', 3, 2019),
(124, 'KQ124', 'MH124', 4, 2020),
(125, 'KQ125', 'MH125', 5, 2021),
(126, 'KQ126', 'MH126', 6, 2022),
(127, 'KQ127', 'MH127', 1, 2017),
(128, 'KQ128', 'MH128', 2, 2018),
(129, 'KQ129', 'MH129', 3, 2019),
(130, 'KQ130', 'MH130', 4, 2020),
(131, 'KQ131', 'MH131', 5, 2021),
(132, 'KQ132', 'MH132', 6, 2022),
(133, 'KQ133', 'MH133', 1, 2017),
(134, 'KQ134', 'MH134', 2, 2018),
(135, 'KQ135', 'MH135', 3, 2019),
(136, 'KQ136', 'MH136', 4, 2020),
(137, 'KQ137', 'MH137', 5, 2021),
(138, 'KQ138', 'MH138', 6, 2022),
(139, 'KQ139', 'MH139', 1, 2017),
(140, 'KQ140', 'MH140', 2, 2018),
(141, 'KQ141', 'MH141', 3, 2019),
(142, 'KQ142', 'MH142', 4, 2020),
(143, 'KQ143', 'MH143', 5, 2021),
(144, 'KQ144', 'MH144', 6, 2022),
(145, 'KQ145', 'MH145', 1, 2017),
(146, 'KQ146', 'MH146', 2, 2018),
(147, 'KQ147', 'MH147', 3, 2019),
(148, 'KQ148', 'MH148', 4, 2020),
(149, 'KQ149', 'MH149', 5, 2021),
(150, 'KQ150', 'MH150', 6, 2022),
(151, 'KQ151', 'MH151', 1, 2017),
(152, 'KQ152', 'MH152', 2, 2018),
(153, 'KQ153', 'MH153', 3, 2019),
(154, 'KQ154', 'MH154', 4, 2020),
(155, 'KQ155', 'MH155', 5, 2021),
(156, 'KQ156', 'MH156', 6, 2022),
(157, 'KQ157', 'MH157', 1, 2017),
(158, 'KQ158', 'MH158', 2, 2018),
(159, 'KQ159', 'MH159', 3, 2019),
(160, 'KQ160', 'MH160', 4, 2020),
(161, 'KQ161', 'MH161', 5, 2021),
(162, 'KQ162', 'MH162', 6, 2022),
(163, 'KQ163', 'MH163', 3, 2019),
(164, 'KQ164', 'MH164', 3, 2019);

-- --------------------------------------------------------

--
-- Table structure for table `KHOA`
--

CREATE TABLE `KHOA` (
  `id` int(11) NOT NULL,
  `makhoa` varchar(10) COLLATE utf8mb4_unicode_ci NOT NULL,
  `tenkhoa` varchar(30) COLLATE utf8mb4_unicode_ci NOT NULL,
  `magv` varchar(10) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `sdt` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `KHOA`
--

INSERT INTO `KHOA` (`id`, `makhoa`, `tenkhoa`, `magv`, `sdt`) VALUES
(1, 'KCB', 'Khoa Cơ Bản', 'GV001', '0915489628'),
(2, 'KCK', 'Khoa Cơ Khí', 'GV016', '0913546512'),
(3, 'ĐTVT', 'Khoa Điện Tử Viễn Thông', 'GV041', '0341659845'),
(4, 'CNTT', 'Khoa CNTT', 'GV005', '0654983515'),
(5, 'ĐBDCN', 'Khoa Điện & Bảo Dưỡng CN', 'GV032', '0341651648'),
(6, 'KTQL', 'Khoa Kinh Tế Quản Lý', 'GV051', '0329985112');

-- --------------------------------------------------------

--
-- Table structure for table `MONHOC`
--

CREATE TABLE `MONHOC` (
  `id` int(10) DEFAULT NULL,
  `mamh` varchar(10) DEFAULT NULL,
  `tenmh` varchar(255) DEFAULT NULL,
  `stlt` int(11) DEFAULT NULL,
  `stth` int(1) DEFAULT NULL,
  `sglt` int(2) DEFAULT NULL,
  `sgth` int(2) DEFAULT NULL,
  `magv` varchar(10) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `MONHOC`
--

INSERT INTO `MONHOC` (`id`, `mamh`, `tenmh`, `stlt`, `stth`, `sglt`, `sgth`, `magv`) VALUES
(1, 'MH001', 'Chính trị', 4, 4, 30, 30, 'GV001'),
(2, 'MH002', 'Pháp luật', 4, 4, 30, 30, 'GV002'),
(3, 'MH003', 'Toán cao cấp', 4, 4, 30, 30, 'GV003'),
(4, 'MH004', 'Tin học căn bản', 4, 4, 30, 30, 'GV004'),
(5, 'MH005', 'Anh văn 1', 4, 4, 30, 30, 'GV005'),
(6, 'MH006', 'Giáo dục quốc phòng', 4, 4, 30, 30, 'GV006'),
(7, 'MH007', 'Giáo dục thể chất', 4, 4, 30, 30, 'GV007'),
(8, 'MH008', 'Anh văn 2', 4, 4, 30, 30, 'GV005'),
(9, 'MH009', 'Bảng tính Excel', 4, 4, 30, 30, 'GV008'),
(10, 'MH010', 'Lập trình căn bản', 4, 4, 30, 30, 'GV004'),
(11, 'MH011', 'Kỹ năng mềm', 4, 4, 30, 30, 'GV009'),
(12, 'MH012', 'Mạng máy tính', 4, 4, 30, 30, 'GV010'),
(13, 'MH013', 'Cấu trúc máy tính', 4, 4, 30, 30, 'GV011'),
(14, 'MH014', 'Hệ QTCSDL SQL Server', 4, 4, 30, 30, 'GV008'),
(15, 'MH015', 'Anh văn chuyên ngành 1', 4, 4, 30, 30, 'GV012'),
(16, 'MH016', 'Cơ sở dữ liệu', 4, 4, 30, 30, 'GV013'),
(17, 'MH017', 'Quản trị mạng Windows', 4, 4, 30, 30, 'GV010'),
(18, 'MH018', 'Cấu trúc dữ liệu và giải thuật', 4, 4, 30, 30, 'GV014'),
(19, 'MH019', 'Lập trình hướng đối tượng', 4, 4, 30, 30, 'GV015'),
(20, 'MH020', 'Đồ họa ứng dụng', 4, 4, 30, 30, 'GV016'),
(21, 'MH021', 'Thực tập nhận thức', 4, 4, 30, 30, 'GV017'),
(22, 'MH022', 'Anh văn chuyên ngành 2', 4, 4, 30, 30, 'GV018'),
(23, 'MH023', 'Thiết kế, xây dựng mạng LAN', 4, 4, 30, 30, 'GV010'),
(24, 'MH024', 'Lập trình C#', 4, 4, 30, 30, 'GV009'),
(25, 'MH025', 'Bảo trì hệ thống', 4, 4, 30, 30, 'GV014'),
(26, 'MH026', 'Phân tích thiết kế hệ thống', 4, 4, 30, 30, 'GV019'),
(27, 'MH027', 'Xây dựng Website', 4, 4, 30, 30, 'GV004'),
(28, 'MH028', 'Thực tập nghề nghiệp', 4, 4, 30, 30, 'GV017'),
(29, 'MH029', 'An toàn bảo mật thông tin', 4, 4, 30, 30, 'GV014'),
(30, 'MH030', 'Xây dựng Website bằng PMMNM', 4, 4, 30, 30, 'GV020'),
(31, 'MH031', 'Tổ chức quản lý doanh nghiệp', 4, 4, 30, 30, 'GV021'),
(32, 'MH032', 'Công nghệ phần mềm', 4, 4, 30, 30, 'GV022'),
(33, 'MH033', 'Quản lý dự án CNTT', 4, 4, 30, 30, 'GV015'),
(34, 'MH034', 'Xây dựng phần mềm quản lý', 4, 4, 30, 30, 'GV022'),
(35, 'MH035', 'Thực tập tốt nghiệp', 4, 4, 30, 30, 'GV017'),
(36, 'MH036', 'Đồ án/ Thi tốt nghiệp', 4, 4, 30, 30, 'GV017'),
(37, 'MH037', 'Vẽ kỹ thuật và AutoCAD', 4, 4, 30, 30, 'GV016'),
(38, 'MH038', 'Dung sai và kỹ thuật đo', 4, 4, 30, 30, 'GV023'),
(39, 'MH039', 'Kỹ thuật điện', 4, 4, 30, 30, 'GV023'),
(40, 'MH040', 'Kỹ thuật điện tử', 4, 4, 30, 30, 'GV023'),
(41, 'MH041', 'Kỹ thuật nhiệt', 4, 4, 30, 30, 'GV023'),
(42, 'MH042', 'Cơ lý thuyết', 4, 4, 30, 30, 'GV024'),
(43, 'MH043', 'Vẽ kỹ thuật 2', 4, 4, 30, 30, 'GV016'),
(44, 'MH044', 'Nguyên lý, chi tiết máy', 4, 4, 30, 30, 'GV024'),
(45, 'MH045', 'Sức bền, vật liệu', 4, 4, 30, 30, 'GV024'),
(46, 'MH046', 'Kỹ thuật an toàn & BHLD', 4, 4, 30, 30, 'GV025'),
(47, 'MH047', 'Tổ chức và quản lý sản xuất', 4, 4, 30, 30, 'GV025'),
(48, 'MH048', 'Cơ khí đại cương và VL cơ khí', 4, 4, 30, 30, 'GV024'),
(49, 'MH049', 'Nguyên lý cắt và dụng cụ cắt', 4, 4, 30, 30, 'GV026'),
(50, 'MH050', 'Máy công cụ', 4, 4, 30, 30, 'GV026'),
(51, 'MH051', 'Công nghệ chế tạo máy', 4, 4, 30, 30, 'GV026'),
(52, 'MH052', 'Kỹ thuật tiện', 4, 4, 30, 30, 'GV027'),
(53, 'MH053', 'Kỹ thuật phay', 4, 4, 30, 30, 'GV027'),
(54, 'MH054', 'Đồ gá', 4, 4, 30, 30, 'GV027'),
(55, 'MH055', 'Công nghệ gia công áp lực', 4, 4, 30, 30, 'GV028'),
(56, 'MH056', 'Công nghệ CNC', 4, 4, 30, 30, 'GV028'),
(57, 'MH057', 'Robot công nghiệp', 4, 4, 30, 30, 'GV028'),
(58, 'MH058', 'Truyền động khí nén thủy lực', 4, 4, 30, 30, 'GV029'),
(59, 'MH059', 'Thiết kế quy trình công nghệ', 4, 4, 30, 30, 'GV029'),
(60, 'MH060', 'Tính toán thiết kế một số cụm TD', 4, 4, 30, 30, 'GV029'),
(61, 'MH061', 'Kỹ thuật CAD/CAM', 4, 4, 30, 30, 'GV030'),
(62, 'MH062', 'Hệ thống FMS/CIM', 4, 4, 30, 30, 'GV030'),
(63, 'MH063', 'Anh văn chuyên ngành', 4, 4, 30, 30, 'GV012'),
(64, 'MH064', 'Thực tập tốt nghiệp', 4, 4, 30, 30, 'GV014'),
(65, 'MH065', 'Thực tập nhận thức', 4, 4, 30, 30, 'GV014'),
(66, 'MH066', 'Kỹ thuật bào và xọc', 4, 4, 30, 30, 'GV031'),
(67, 'MH067', 'Kỹ thuật mài', 4, 4, 30, 30, 'GV031'),
(68, 'MH068', 'Kỹ thuật gia công bánh răng', 4, 4, 30, 30, 'GV031'),
(69, 'MH069', 'Thực tập nghề nghiệp', 4, 4, 30, 30, 'GV014'),
(70, 'MH070', 'Kỹ thuật hàn', 4, 4, 30, 30, 'GV031'),
(71, 'MH071', 'Đồ án tốt nghiệp', 4, 4, 30, 30, 'GV014'),
(72, 'MH072', 'Nhập môn điện và điện lạnh', 4, 4, 30, 30, 'GV032'),
(73, 'MH073', 'Lý thuyết mạch điện', 4, 4, 30, 30, 'GV032'),
(74, 'MH074', 'Vẽ kỹ thuật', 4, 4, 30, 30, 'GV032'),
(75, 'MH075', 'Kỹ thuật điện tử', 4, 4, 30, 30, 'GV033'),
(76, 'MH076', 'Vẽ điện', 4, 4, 30, 30, 'GV033'),
(77, 'MH077', 'Kỹ thuật cơ khí', 4, 4, 30, 30, 'GV033'),
(78, 'MH078', 'Vật liệu điện & an toàn điện', 4, 4, 30, 30, 'GV034'),
(79, 'MH079', 'Đo lường - cảm biến', 4, 4, 30, 30, 'GV034'),
(80, 'MH080', 'Kỹ thuật thủy khí', 4, 4, 30, 30, 'GV034'),
(81, 'MH081', 'Anh văn chuyên ngành', 4, 4, 30, 30, 'GV035'),
(82, 'MH082', 'Kỹ thuật nhiệt - lạnh', 4, 4, 30, 30, 'GV035'),
(83, 'MH083', 'Máy điện', 4, 4, 30, 30, 'GV035'),
(84, 'MH084', 'Khí cụ điện', 4, 4, 30, 30, 'GV036'),
(85, 'MH085', 'Điện từ công suất', 4, 4, 30, 30, 'GV036'),
(86, 'MH086', 'Thực tập nhận thức', 4, 4, 30, 30, 'GV036'),
(87, 'MH087', 'Kỹ thuật lắp đặt điện', 4, 4, 30, 30, 'GV037'),
(88, 'MH088', 'Kỹ thuật xung - số', 4, 4, 30, 30, 'GV037'),
(89, 'MH089', 'Cung cấp điện', 4, 4, 30, 30, 'GV037'),
(90, 'MH090', 'PLC', 4, 4, 30, 30, 'GV038'),
(91, 'MH091', 'Truyền động điện', 4, 4, 30, 30, 'GV038'),
(92, 'MH092', 'Thực tập nghề nghiệp', 4, 4, 30, 30, 'GV038'),
(93, 'MH093', 'Thiết bị điện dân dụng', 4, 4, 30, 30, 'GV039'),
(94, 'MH094', 'SCADA và Mạng truyền thông CN', 4, 4, 30, 30, 'GV039'),
(95, 'MH095', 'Tổ chức sản xuất', 4, 4, 30, 30, 'GV039'),
(96, 'MH096', 'Trang bị điện', 4, 4, 30, 30, 'GV040'),
(97, 'MH097', 'Kỹ thuật vi điều khiển', 4, 4, 30, 30, 'GV040'),
(98, 'MH098', 'Điều khiển thông minh', 4, 4, 30, 30, 'GV040'),
(99, 'MH099', 'Thực tập tốt nghiệp', 4, 4, 30, 30, 'GV041'),
(100, 'MH100', 'Đồ án/ Thi tốt nghiệp', 4, 4, 30, 30, 'GV041'),
(101, 'MH101', 'Nhập môn điện tử công nghiệp', 4, 4, 30, 30, 'GV041'),
(102, 'MH102', 'Cấu kiện điện tử', 4, 4, 30, 30, 'GV042'),
(103, 'MH103', 'Đo lường điện tử', 4, 4, 30, 30, 'GV042'),
(104, 'MH104', 'Kỹ thuật điện', 4, 4, 30, 30, 'GV042'),
(105, 'MH105', 'Kỹ thuật cơ khí', 4, 4, 30, 30, 'GV043'),
(106, 'MH106', 'Kỹ thuật mạch điện tử I', 4, 4, 30, 30, 'GV043'),
(107, 'MH107', 'Vẽ mạch điện tử', 4, 4, 30, 30, 'GV043'),
(108, 'MH108', 'Công nghệ chế tạo mạch in', 4, 4, 30, 30, 'GV044'),
(109, 'MH109', 'Kỹ thuật số 1', 4, 4, 30, 30, 'GV044'),
(110, 'MH110', 'Khí cụ điện và an toàn điện', 4, 4, 30, 30, 'GV044'),
(111, 'MH111', 'Tiếng Anh chuyên ngành', 4, 4, 30, 30, 'GV045'),
(112, 'MH112', 'Kỹ thuật số 2', 4, 4, 30, 30, 'GV045'),
(113, 'MH113', 'Kỹ thuật mạch điện tử II', 4, 4, 30, 30, 'GV045'),
(114, 'MH114', 'Điện tử công suất', 4, 4, 30, 30, 'GV001'),
(115, 'MH115', 'Cơ sở thông tin số', 4, 4, 30, 30, 'GV001'),
(116, 'MH116', 'Kỹ thuật vi điều khiển I', 4, 4, 30, 30, 'GV002'),
(117, 'MH117', 'Kỹ thuật lập trình C', 4, 4, 30, 30, 'GV002'),
(118, 'MH118', 'Thực tập nhận thức', 4, 4, 30, 30, 'GV046'),
(119, 'MH119', 'PLC', 4, 4, 30, 30, 'GV046'),
(120, 'MH120', 'Máy điện', 4, 4, 30, 30, 'GV046'),
(121, 'MH121', 'Kỹ thuật cảm biến', 4, 4, 30, 30, 'GV047'),
(122, 'MH122', 'Trang bị điện', 4, 4, 30, 30, 'GV047'),
(123, 'MH123', 'Kỹ thuật vi điều khiển II', 4, 4, 30, 30, 'GV047'),
(124, 'MH124', 'Thiết kế mạch điện tử', 4, 4, 30, 30, 'GV048'),
(125, 'MH125', 'Thực tập nghề nghiệp', 4, 4, 30, 30, 'GV048'),
(126, 'MH126', 'Điều khiển khí nén thủy khí', 4, 4, 30, 30, 'GV048'),
(127, 'MH127', 'Quản lý DN và tổ chức sx', 4, 4, 30, 30, 'GV049'),
(128, 'MH128', 'Kỹ thuật tự động hóa thiết bị điện', 4, 4, 30, 30, 'GV049'),
(129, 'MH129', 'Kỹ thật robot công nghiệp', 4, 4, 30, 30, 'GV049'),
(130, 'MH130', 'Kỹ thuật mạng truyền thông CN', 4, 4, 30, 30, 'GV050'),
(131, 'MH131', 'Kỹ thuật truyền hình', 4, 4, 30, 30, 'GV050'),
(132, 'MH132', 'Cơ sở Internet vạn vật', 4, 4, 30, 30, 'GV050'),
(133, 'MH133', 'Thực tập tốt nghiệp', 4, 4, 30, 30, 'GV051'),
(134, 'MH134', 'Đồ án tốt nghiệp', 4, 4, 30, 30, 'GV051'),
(135, 'MH135', 'Anh văn 2', 4, 4, 30, 30, 'GV051'),
(136, 'MH136', 'Lý thuyết tài chính tiền tệ', 4, 4, 30, 30, 'GV052'),
(137, 'MH137', 'Nguyên lí kế toán', 4, 4, 30, 30, 'GV052'),
(138, 'MH138', 'Luật kinh doanh', 4, 4, 30, 30, 'GV052'),
(139, 'MH139', 'Kinh tế vi mô', 4, 4, 30, 30, 'GV053'),
(140, 'MH140', 'Quản trị học', 4, 4, 30, 30, 'GV053'),
(141, 'MH141', 'Tài chính doanh nghiệp 1', 4, 4, 30, 30, 'GV053'),
(142, 'MH142', 'Anh văn chuyên ngành', 4, 4, 30, 30, 'GV054'),
(143, 'MH143', 'Hệ thống thông tin quản lý', 4, 4, 30, 30, 'GV054'),
(144, 'MH144', 'Marketing cơ bản', 4, 4, 30, 30, 'GV054'),
(145, 'MH145', 'Kỹ năng mềm', 4, 4, 30, 30, 'GV055'),
(146, 'MH146', 'Thực tập nhận thức', 4, 4, 30, 30, 'GV055'),
(147, 'MH147', 'Tài chính doanh nghiệp 2', 4, 4, 30, 30, 'GV055'),
(148, 'MH148', 'Quản trị chất lượng', 4, 4, 30, 30, 'GV056'),
(149, 'MH149', 'Hành vi tổ chức', 4, 4, 30, 30, 'GV056'),
(150, 'MH150', 'Tin học ứng dụng trong KD', 4, 4, 30, 30, 'GV056'),
(151, 'MH151', 'Quản trị doanh nghiệp 1', 4, 4, 30, 30, 'GV057'),
(152, 'MH152', 'Quản trị dự án đầu tư', 4, 4, 30, 30, 'GV057'),
(153, 'MH153', 'Quản trị nhân lực', 4, 4, 30, 30, 'GV057'),
(154, 'MH154', 'Kinh tế thương mại và dịch vụ', 4, 4, 30, 30, 'GV058'),
(155, 'MH155', 'Quản trị kinh doanh và tác nghiệp', 4, 4, 30, 30, 'GV058'),
(156, 'MH156', 'Quản trị doanh nghiệp 2', 4, 4, 30, 30, 'GV058'),
(157, 'MH157', 'Chiến lược và kế hoạch KD', 4, 4, 30, 30, 'GV059'),
(158, 'MH158', 'Kế toán quản trị', 4, 4, 30, 30, 'GV059'),
(159, 'MH159', 'Phân tích hoạt động kinh doanh', 4, 4, 30, 30, 'GV059'),
(160, 'MH160', 'Tâm lý kinh doanh', 4, 4, 30, 30, 'GV060'),
(161, 'MH161', 'Quản trị Marketing', 4, 4, 30, 30, 'GV060'),
(162, 'MH162', 'Khởi nghiệp và tìm kiếm việc làm', 4, 4, 30, 30, 'GV060'),
(163, 'MH163', 'Thực tập nghề nghiệp', 4, 4, 30, 30, 'GV061'),
(164, 'MH164', 'Đồ án tốt nghiệp', 4, 4, 30, 30, 'GV061');

-- --------------------------------------------------------

--
-- Table structure for table `SINHVIEN`
--

CREATE TABLE `SINHVIEN` (
  `id` int(11) NOT NULL,
  `masv` varchar(10) COLLATE utf8mb4_unicode_ci NOT NULL,
  `hoten` varchar(255) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL,
  `ngaysinh` date NOT NULL,
  `diachi` varchar(50) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL,
  `gioitinh` varchar(50) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL,
  `lop` varchar(255) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL,
  `makhoa` varchar(10) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL,
  `chart_id` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `SINHVIEN`
--

INSERT INTO `SINHVIEN` (`id`, `masv`, `hoten`, `ngaysinh`, `diachi`, `gioitinh`, `lop`, `makhoa`, `chart_id`) VALUES
(1, 'CD0001', 'Phạm Mai Chiii', '2001-03-16', 'Hà Nội', 'Nam', 'Ngoại ngữ', 'KCB', 1),
(2, 'CD0002', 'Nguyễn Văn Dũng', '2001-06-19', 'Bắc Giang', 'Nam', 'Ngoại ngữ', 'KCB', 2),
(3, 'CD0003', 'Phạm Văn Dũng', '2001-05-18', 'Bắc Giang', 'Nam', 'Ngoại ngữ', 'KCB', 3),
(4, 'CD0004', 'Bùi Quốc Dương', '2001-07-09', 'Hà Nội', 'Nam', 'Ngoại ngữ', 'KCB', 4),
(5, 'CD0005', 'Nguyễn Văn Đạt', '2001-09-09', 'Hà Nội', 'Nam', 'Ngoại ngữ', 'KCB', 5),
(6, 'CD0006', 'Nguyễn Thế Hùng', '2001-11-11', 'Hà Nội', 'Nam', 'Ngoại ngữ', 'KCB', 6),
(7, 'CD0007', 'Nguyễn Văn Huy', '2001-10-08', 'Hà Nội', 'Nam', 'Ngoại ngữ', 'KCB', 7),
(8, 'CD0008', 'Chu Quang Nam', '2001-11-26', 'Hưng Yên', 'Nam', 'Ngoại ngữ', 'KCB', 8),
(9, 'CD0009', 'Phạm Huỳnh Lưu Phong', '2001-03-04', 'Nam Định', 'Nam', 'Ngoại ngữ', 'KCB', 9),
(10, 'CD0010', 'Nguyễn Xuân Phương', '2001-01-22', 'Quảng Ninh', 'Nữ', 'Ngoại ngữ', 'KCB', 10),
(11, 'CD0011', 'Hoàng Ngọc Thanh', '2001-04-04', 'Nghệ An', 'Nữ', 'Ngoại ngữ', 'KCB', 11),
(12, 'CD0012', 'Trần Thị Thủy', '2001-03-20', 'Nghệ An', 'Nữ', 'Ngoại ngữ', 'KCB', 12),
(13, 'CD0013', 'Nguyễn Thanh Thủy', '2001-08-12', 'Thái Nguyên', 'Nữ', 'Ngoại ngữ', 'KCB', 13),
(14, 'CD0014', 'Trần Thị Phương Thảo', '2001-11-07', 'Thái Nguyên', 'Nữ', 'Ngoại ngữ', 'KCB', 14),
(15, 'CD0015', 'Nguyễn Phương Thảo', '2001-02-12', 'Thái Nguyên', 'Nữ', 'Ngoại ngữ', 'KCB', 15),
(16, 'CD0016', 'Phạm Thị Thanh Thủy', '2001-04-29', 'Hà Nội', 'Nữ', 'Ngoại ngữ', 'KCB', 16),
(17, 'CD0017', 'Nguyễn Trọng Thủy', '2001-02-23', 'Hà Nội', 'Nam', 'Ngoại ngữ', 'KCB', 17),
(18, 'CD0018', 'Lê Quốc Việt', '2001-05-15', 'Hà Nội', 'Nam', 'Ngoại ngữ', 'KCB', 18),
(19, 'CD0019', 'Trần Tuyết Vân', '2001-11-23', 'Hà Nội', 'Nữ', 'Ngoại ngữ', 'KCB', 19),
(20, 'CD0020', 'Hoàng Văn Vũ', '2001-09-17', 'Thái Bình', 'Nam', 'Ngoại ngữ', 'KCB', 20),
(21, 'CD0021', 'Lê Thị Vân Anh', '2001-02-22', 'Thái Nguyên', 'Nữ', 'Toán Cao Cấp', 'KCB', 21),
(22, 'CD0022', 'Nguyễn Quang Anh', '2001-06-16', 'Hà Tĩnh', 'Nam', 'Toán Cao Cấp', 'KCB', 22),
(23, 'CD0023', 'Nguyễn Trần Mai Anh', '2001-09-09', 'Hà Tĩnh', 'Nữ', 'Toán Cao Cấp', 'KCB', 23),
(24, 'CD0024', 'Nguyễn Thùy Dung', '2001-05-04', 'Hà Nội', 'Nữ', 'Toán Cao Cấp', 'KCB', 24),
(25, 'CD0025', 'Nguyễn Mạnh Dũng', '2001-02-24', 'Hà Nội', 'Nam', 'Toán Cao Cấp', 'KCB', 25),
(26, 'CD0026', 'Trần Văn Hải', '2001-06-22', 'Thanh Hóa', 'Nam', 'Toán Cao Cấp', 'KCB', 26),
(27, 'CD0027', 'Nguyễn Thị Thu Hằng', '2001-05-11', 'Thanh Hóa', 'Nữ', 'Toán Cao Cấp', 'KCB', 27),
(28, 'CD0028', 'Nguyễn Thị Hân', '2001-02-12', 'Thanh Hóa', 'Nữ', 'Toán Cao Cấp', 'KCB', 28),
(29, 'CD0029', 'Cù Thị Thúy Hiền', '2001-08-06', 'Thanh Hóa', 'Nữ', 'Toán Cao Cấp', 'KCB', 29),
(30, 'CD0030', 'Lê Thế Hải', '2001-07-23', 'Thái Nguyên', 'Nam', 'Toán Cao Cấp', 'KCB', 30),
(31, 'CD0031', 'Đinh Quang Hiệp', '2001-01-28', 'Thái Bình', 'Nữ', 'Toán Cao Cấp', 'KCB', 31),
(32, 'CD0032', 'Lê Việt Hoàng', '2001-11-15', 'Thái Bình', 'Nữ', 'Toán Cao Cấp', 'KCB', 32),
(33, 'CD0033', 'Nguyễn Anh Hoàng', '2001-04-16', 'Ninh Bình', 'Nữ', 'Toán Cao Cấp', 'KCB', 33),
(34, 'CD0034', 'Hoàng Xuân Hùng', '2001-10-01', 'Sơn La', 'Nữ', 'Toán Cao Cấp', 'KCB', 34),
(35, 'CD0035', 'Nguyễn Quang Huy', '2001-10-24', 'Sơn La', 'Nữ', 'Toán Cao Cấp', 'KCB', 35),
(36, 'CD0036', 'Phạm Quyết Thắng', '2001-11-08', 'Hà Nội', 'Nữ', 'Toán Cao Cấp', 'KCB', 36),
(37, 'CD0037', 'Lê Quang Thọ', '2001-10-30', 'Hà Nội', 'Nam', 'Toán Cao Cấp', 'KCB', 37),
(38, 'CD0038', 'Lê Hoàng Thoại', '2001-11-10', 'Hà Nội', 'Nam', 'Toán Cao Cấp', 'KCB', 38),
(39, 'CD0039', 'Tiêu Quyết Tiến', '2001-11-20', 'Hà Nội', 'Nữ', 'Toán Cao Cấp', 'KCB', 39),
(40, 'CD0040', 'Phạm Đức Toàn', '2001-09-26', 'Hà Nội', 'Nam', 'Toán Cao Cấp', 'KCB', 40),
(41, 'CD0041', 'Lê Việt Anh', '2001-03-16', 'Hà Nội', 'Nam', 'Chính Trị', 'KCB', 41),
(42, 'CD0042', 'Ngô Lê Tiến Anh', '2001-06-19', 'Hà Nội', 'Nam', 'Chính Trị', 'KCB', 42),
(43, 'CD0043', 'Nguyễn Hoàng Anh', '2001-05-18', 'Hà Nội', 'Nam', 'Chính Trị', 'KCB', 43),
(44, 'CD0044', 'Nguyễn Văn Bắc', '2001-07-09', 'Hà Nội', 'Nam', 'Chính Trị', 'KCB', 44),
(45, 'CD0045', 'Phùng Văn Chiến', '2001-09-09', 'Hà Nội', 'Nam', 'Chính Trị', 'KCB', 45),
(46, 'CD0046', 'Đào Thành Công', '2001-11-11', 'Hà Nội', 'Nam', 'Chính Trị', 'KCB', 46),
(47, 'CD0047', 'Trương Trọng Công', '2001-10-08', 'Hà Nội', 'Nam', 'Chính Trị', 'KCB', 47),
(48, 'CD0048', 'Nguyễn Văn Cường', '2001-11-26', 'Quảng Ninh', 'Nam', 'Chính Trị', 'KCB', 48),
(49, 'CD0049', 'Phan Xuân Dân', '2001-03-04', 'Quảng Ninh', 'Nam', 'Chính Trị', 'KCB', 49),
(50, 'CD0050', 'Phùng Tiến Dũng', '2001-01-22', 'Quảng Ninh', 'Nam', 'Chính Trị', 'KCB', 50),
(51, 'CD0051', 'Phạm Khương Duy', '2001-04-04', 'Vĩnh Phúc', 'Nam', 'Chính Trị', 'KCB', 51),
(52, 'CD0052', 'Bùi Thành Đạt', '2001-03-20', 'Tuyên Quang', 'Nam', 'Chính Trị', 'KCB', 52),
(53, 'CD0053', 'Nguyễn Thành Đạt', '2001-08-12', 'Thái Nguyên', 'Nam', 'Chính Trị', 'KCB', 53),
(54, 'CD0054', 'Lê Duy Hiệu', '2001-11-07', 'Thái Nguyên', 'Nam', 'Chính Trị', 'KCB', 54),
(55, 'CD0055', 'Đào Minh Khiêm', '2001-02-12', 'Hải Phòng', 'Nam', 'Chính Trị', 'KCB', 55),
(56, 'CD0056', 'Lê Minh Đình Khôi', '2001-04-29', 'Hải Phòng', 'Nam', 'Chính Trị', 'KCB', 56),
(57, 'CD0057', 'Phạm Trọng Nghĩa', '2001-02-23', 'Hưng Yên', 'Nam', 'Chính Trị', 'KCB', 57),
(58, 'CD0058', 'Vương Gia Phong', '2001-05-15', 'Hà Nội', 'Nam', 'Chính Trị', 'KCB', 58),
(59, 'CD0059', 'Bùi Minh Quốc', '2001-11-23', 'Hà Nội', 'Nam', 'Chính Trị', 'KCB', 59),
(60, 'CD0060', 'Lê Thanh Tân', '2001-09-17', 'Hưng Yên', 'Nam', 'Chính Trị', 'KCB', 60),
(61, 'CD0061', 'Ngô Tuấn Anh', '2001-04-23', 'Vĩnh Phúc', 'Nam', 'Pháp Luật', 'KCB', 61),
(62, 'CD0062', 'Nguyễn Thế Anh', '2001-01-29', 'Thái Nguyên', 'Nam', 'Pháp Luật', 'KCB', 62),
(63, 'CD0063', 'Phan Tuấn Anh', '2001-01-10', 'Nam Định', 'Nam', 'Pháp Luật', 'KCB', 63),
(64, 'CD0064', 'Trần Xuân Bình', '2001-10-15', 'Hưng Yên', 'Nam', 'Pháp Luật', 'KCB', 64),
(65, 'CD0065', 'Nguyễn Xuân Chính', '2001-11-24', 'Hưng Yên', 'Nam', 'Pháp Luật', 'KCB', 65),
(66, 'CD0066', 'Nguyễn Duy Cường', '2001-04-22', 'Quảng Ninh', 'Nam', 'Pháp Luật', 'KCB', 66),
(67, 'CD0067', 'Hoàng Quốc Dân', '2001-05-06', 'Hòa Bình', 'Nam', 'Pháp Luật', 'KCB', 67),
(68, 'CD0068', 'Trần Văn Dũng', '2001-05-17', 'Hòa Bình', 'Nam', 'Pháp Luật', 'KCB', 68),
(69, 'CD0069', 'Phan Xuân Dân', '2001-07-23', 'Hà Nội', 'Nam', 'Pháp Luật', 'KCB', 69),
(70, 'CD0070', 'Hoàng Ngọc Hải', '2001-05-15', 'Sơn la', 'Nam', 'Pháp Luật', 'KCB', 70),
(71, 'CD0071', 'Hà Mạnh Huy', '2001-10-23', 'Hà Nội', 'Nam', 'Pháp Luật', 'KCB', 71),
(72, 'CD0072', 'Bùi Hữu Khắc', '2001-03-31', 'Hà Nam', 'Nam', 'Pháp Luật', 'KCB', 72),
(73, 'CD0073', 'Phan Tuấn Linh', '2001-09-20', 'Hà Nam', 'Nam', 'Pháp Luật', 'KCB', 73),
(74, 'CD0074', 'Phạm Việt Nam', '2001-07-16', 'Ninh Bình', 'Nam', 'Pháp Luật', 'KCB', 74),
(75, 'CD0075', 'Đàm Danh Quang', '2001-05-11', 'Thái Bình', 'Nam', 'Pháp Luật', 'KCB', 75),
(76, 'CD0076', 'Nguyễn Đức Tâm', '2001-01-13', 'Thanh Hóa', 'Nam', 'Pháp Luật', 'KCB', 76),
(77, 'CD0077', 'Nguyễn Xuân Thắng', '2001-09-22', 'Nghệ An', 'Nam', 'Pháp Luật', 'KCB', 77),
(78, 'CD0078', 'Lê Minh Tiến', '2001-12-26', 'Hải Phòng', 'Nam', 'Pháp Luật', 'KCB', 78),
(79, 'CD0079', 'Lưu Minh Tú', '2001-05-19', 'Hải Phòng', 'Nam', 'Pháp Luật', 'KCB', 79),
(80, 'CD0080', 'Tạ Quốc Việt', '2001-01-23', 'Hải Phòng', 'Nam', 'Pháp Luật', 'KCB', 80),
(81, 'CD0081', 'Trần Văn Chanh', '2001-04-25', 'Bắc Ninh', 'Nam', 'Thể Chất', 'KCB', 81),
(82, 'CD0082', 'Nguyễn Thị Thu Cúc', '2001-10-22', 'Hà Nội', 'Nữ', 'Thể Chất', 'KCB', 82),
(83, 'CD0083', 'Cao Thị Linh Đan', '2001-10-31', 'Vĩnh Phúc', 'Nữ', 'Thể Chất', 'KCB', 83),
(84, 'CD0084', 'Hồ Ngọc Lan Đài', '2001-09-30', 'Hưng Yên', 'Nữ', 'Thể Chất', 'KCB', 84),
(85, 'CD0085', 'Nguyễn Thanh Dũng', '2001-03-02', 'Hải Dương', 'Nam', 'Thể Chất', 'KCB', 85),
(86, 'CD0086', 'Phan Huỳnh Giao', '2001-11-26', 'Lai Châu', 'Nam', 'Thể Chất', 'KCB', 86),
(87, 'CD0087', 'Nguyễn Thị Hồng Hạnh', '2001-01-19', 'Phú Thọ', 'Nữ', 'Thể Chất', 'KCB', 87),
(88, 'CD0088', 'Phan Huy Hải', '2001-11-30', 'Tuyên Quang', 'Nam', 'Thể Chất', 'KCB', 88),
(89, 'CD0089', 'Đào Trọng Hiếu', '2001-11-02', 'Lào Cai', 'Nam', 'Thể Chất', 'KCB', 89),
(90, 'CD0090', 'Lê Huy Hoàng', '2001-01-11', 'Yên Bái', 'Nam', 'Thể Chất', 'KCB', 90),
(91, 'CD0091', 'Lâm Châu Huỳnh', '2001-03-18', 'Sơn La', 'Nam', 'Thể Chất', 'KCB', 91),
(92, 'CD0092', 'Nguyễn Thị Ngọc Nhung', '2001-02-06', 'Điện Biên', 'Nữ', 'Thể Chất', 'KCB', 92),
(93, 'CD0093', 'Phan Thị Hồng Nhung', '2001-09-15', 'Hải Phòng', 'Nữ', 'Thể Chất', 'KCB', 93),
(94, 'CD0094', 'Trần Thị Kim Phụng', '2001-12-12', 'Nam Định', 'Nữ', 'Thể Chất', 'KCB', 94),
(95, 'CD0095', 'Trịnh Nam Phong', '2001-12-10', 'Phú Thọ', 'Nam', 'Thể Chất', 'KCB', 95),
(96, 'CD0096', 'Nguyễn Văn Phúc', '2001-09-12', 'Vĩnh Phúc', 'Nam', 'Thể Chất', 'KCB', 96),
(97, 'CD0097', 'Đặng Đại Phúc', '2001-03-11', 'Ninh Bình', 'Nam', 'Thể Chất', 'KCB', 97),
(98, 'CD0098', 'Nguyễn Minh Trí', '2001-04-24', 'Thái Bình', 'Nam', 'Thể Chất', 'KCB', 98),
(99, 'CD0099', 'Đỗ Minh Tú', '2001-07-20', 'Hà Nội', 'Nam', 'Thể Chất', 'KCB', 99),
(100, 'CD0100', 'Phan Thanh Tùng', '2001-05-14', 'Hà Nội', 'Nam', 'Thể Chất', 'KCB', 100),
(101, 'CD0101', 'Nguyễn Tuấn Anh', '2001-10-22', 'Hải Dương', 'Nam', 'Quốc Phòng', 'KCB', 101),
(102, 'CD0102', 'Lê Thanh Bình', '2001-03-05', 'Thanh Hóa', 'Nam', 'Quốc Phòng', 'KCB', 102),
(103, 'CD0103', 'Đào Mạnh Cường', '2001-07-06', 'Hà Nội', 'Nam', 'Quốc Phòng', 'KCB', 103),
(104, 'CD0104', 'Lê Trung Hiếu', '2001-08-19', 'Hà Tĩnh', 'Nam', 'Quốc Phòng', 'KCB', 104),
(105, 'CD0105', 'Trần Công Huy', '2001-09-13', 'Hà Nam', 'Nam', 'Quốc Phòng', 'KCB', 105),
(106, 'CD0106', 'Trần Danh Long', '2001-09-23', 'Hà Nội', 'Nam', 'Quốc Phòng', 'KCB', 106),
(107, 'CD0107', 'Đinh Khắc Phong', '2001-09-26', 'Hưng Yên', 'Nam', 'Quốc Phòng', 'KCB', 107),
(108, 'CD0108', 'Khiến Hữu Phong', '2001-05-25', 'Hà Nam', 'Nam', 'Quốc Phòng', 'KCB', 108),
(109, 'CD0109', 'Nguyễn Xuân Sinh', '2001-08-05', 'Nam Định', 'Nam', 'Quốc Phòng', 'KCB', 109),
(110, 'CD0110', 'Nguyễn Văn Tập', '2001-12-15', 'Nghệ An', 'Nam', 'Quốc Phòng', 'KCB', 110),
(111, 'CD0111', 'Lưu Tiến Thiết', '2001-04-28', 'Nam Định', 'Nam', 'Quốc Phòng', 'KCB', 111),
(112, 'CD0112', 'Trần Công Toàn', '2001-09-25', 'Nam Định', 'Nam', 'Quốc Phòng', 'KCB', 112),
(113, 'CD0113', 'Phạm Văn Tới', '2001-05-24', 'Bắc Ninh', 'Nam', 'Quốc Phòng', 'KCB', 113),
(114, 'CD0114', 'Phạm Văn Trung', '2001-06-07', 'Bắc Giang', 'Nam', 'Quốc Phòng', 'KCB', 114),
(115, 'CD0115', 'Nguyễn Thành Tuân', '2001-03-26', 'Phú Thọ', 'Nam', 'Quốc Phòng', 'KCB', 115),
(116, 'CD0116', 'Lê Văn Tuyên', '2001-09-14', 'Vĩnh Phúc', 'Nam', 'Quốc Phòng', 'KCB', 116),
(117, 'CD0117', 'Phạm Long Vũ', '2001-07-16', 'Quảng Ninh', 'Nam', 'Quốc Phòng', 'KCB', 117),
(118, 'CD0118', 'Nguyễn Quốc Việt', '2001-01-22', 'Hải Dương', 'Nam', 'Quốc Phòng', 'KCB', 118),
(119, 'CD0119', 'Lưu Minh Vương', '2001-11-21', 'Thanh Hóa', 'Nam', 'Quốc Phòng', 'KCB', 119),
(120, 'CD0120', 'Lê Tiến Vương', '2001-12-12', 'Hà Nội', 'Nam', 'Quốc Phòng', 'KCB', 120),
(121, 'CD0121', 'Cao Đình An', '2001-08-12', 'Thanh Hóa', 'Nam', 'Chế Tạo Máy', 'KCK', 121),
(122, 'CD0122', 'Đặng Việt Anh', '2001-06-14', 'Hải Dương', 'Nam', 'Chế Tạo Máy', 'KCK', 122),
(123, 'CD0123', 'Nguyễn Tuấn Anh', '2001-12-28', 'Hải Phòng', 'Nam', 'Chế Tạo Máy', 'KCK', 123),
(124, 'CD0124', 'Đồng Văn Cường', '2001-11-25', 'Hà Nội', 'Nam', 'Chế Tạo Máy', 'KCK', 124),
(125, 'CD0125', 'Lê Văn Dũng', '2001-11-09', 'Quảng Ninh', 'Nam', 'Chế Tạo Máy', 'KCK', 125),
(126, 'CD0126', 'Phùng Văn Dương', '2001-05-25', 'Quảng Bình', 'Nam', 'Chế Tạo Máy', 'KCK', 126),
(127, 'CD0127', 'Trần Như Đông', '2001-02-16', 'Tuyên Quang', 'Nam', 'Chế Tạo Máy', 'KCK', 127),
(128, 'CD0128', 'Nguyễn Hoàng Hải', '2001-07-25', 'Điện Biên', 'Nam', 'Chế Tạo Máy', 'KCK', 128),
(129, 'CD0129', 'Nguyễn Hồng Hải', '2001-02-28', 'Lạng Sơn', 'Nam', 'Chế Tạo Máy', 'KCK', 129),
(130, 'CD0130', 'Nguyễn Hoàng Hiệp', '2001-08-11', 'Phú Thọ', 'Nam', 'Chế Tạo Máy', 'KCK', 130),
(131, 'CD0131', 'Vũ Đức Khánh', '2001-04-04', 'Bình Định', 'Nam', 'Chế Tạo Máy', 'KCK', 131),
(132, 'CD0132', 'Nguyễn Trung Kiên', '2001-01-18', 'Phú Thọ', 'Nam', 'Chế Tạo Máy', 'KCK', 132),
(133, 'CD0133', 'Nguyễn Cao Minh', '2001-03-14', 'Lạng Sơn', 'Nam', 'Chế Tạo Máy', 'KCK', 133),
(134, 'CD0134', 'Nguyễn Phương Nam', '2001-09-29', 'Hà Nội', 'Nam', 'Chế Tạo Máy', 'KCK', 134),
(135, 'CD0135', 'Đỗ Hoàng Sơn', '2001-07-08', 'Bắc Ninh', 'Nam', 'Chế Tạo Máy', 'KCK', 135),
(136, 'CD0136', 'Nguyễn Xuân Tài', '2001-07-06', 'Quảng Ninh', 'Nam', 'Chế Tạo Máy', 'KCK', 136),
(137, 'CD0137', 'Nguyễn Trí Trung', '2001-01-25', 'Hải Phòng', 'Nam', 'Chế Tạo Máy', 'KCK', 137),
(138, 'CD0138', 'Nguyễn Đăng Tuấn', '2001-06-11', 'Bắc Ninh', 'Nam', 'Chế Tạo Máy', 'KCK', 138),
(139, 'CD0139', 'Phạm Huy Tùng', '2001-01-22', 'Hà Nội', 'Nam', 'Chế Tạo Máy', 'KCK', 139),
(140, 'CD0140', 'Vũ Văn Tuyên', '2001-03-12', 'Hà Nam', 'Nam', 'Chế Tạo Máy', 'KCK', 140),
(141, 'CD0141', 'Trần Nhật Anh', '2001-08-12', 'Nghệ An', 'Nam', 'Cơ Điện Tử', 'KCK', 141),
(142, 'CD0142', 'Trần Văn Chương', '2001-06-14', 'Thanh Hóa', 'Nam', 'Cơ Điện Tử', 'KCK', 142),
(143, 'CD0143', 'Nguyễn Bùi Quang Cường', '2001-12-28', 'Lạng Sơn', 'Nam', 'Cơ Điện Tử', 'KCK', 143),
(144, 'CD0144', 'Nguyễn Văn Danh', '2001-11-25', 'Nam Định', 'Nam', 'Cơ Điện Tử', 'KCK', 144),
(145, 'CD0145', 'Nguyễn Công Đạt', '2001-11-09', 'Hải Dương', 'Nam', 'Cơ Điện Tử', 'KCK', 145),
(146, 'CD0146', 'Phùng Văn Dương', '2001-05-25', 'Lai Châu', 'Nam', 'Cơ Điện Tử', 'KCK', 146),
(147, 'CD0147', 'Vũ Văn Đô', '2001-02-16', 'Hà Nội', 'Nam', 'Cơ Điện Tử', 'KCK', 147),
(148, 'CD0148', 'Nguyễn Hữu Đức', '2001-07-25', 'Hải Phòng', 'Nam', 'Cơ Điện Tử', 'KCK', 148),
(149, 'CD0149', 'Hứa Hoàng Hải', '2001-02-28', 'Hưng Yên', 'Nam', 'Cơ Điện Tử', 'KCK', 149),
(150, 'CD0150', 'Hoàng Văn Hậu', '2001-08-11', 'Bắc Giang', 'Nam', 'Cơ Điện Tử', 'KCK', 150),
(151, 'CD0151', 'Nguyễn Đức Hoàng', '2001-04-04', 'Phú Thọ', 'Nam', 'Cơ Điện Tử', 'KCK', 151),
(152, 'CD0152', 'Trần Hưng Lâm', '2001-01-18', 'Vĩnh Phúc', 'Nam', 'Cơ Điện Tử', 'KCK', 152),
(153, 'CD0153', 'Đinh Văn Minh', '2001-03-14', 'Bắc Ninh', 'Nam', 'Cơ Điện Tử', 'KCK', 153),
(154, 'CD0154', 'Nguyễn Quang Luật', '2001-09-29', 'Hòa Bình', 'Nam', 'Cơ Điện Tử', 'KCK', 154),
(155, 'CD0155', 'Nguyễn Như Tâm', '2001-07-08', 'Sơn La', 'Nam', 'Cơ Điện Tử', 'KCK', 155),
(156, 'CD0156', 'Hoàng Thanh Tùng', '2001-07-06', 'Hà Nội', 'Nam', 'Cơ Điện Tử', 'KCK', 156),
(157, 'CD0157', 'Hà Phước Việt', '2001-01-25', 'Lào Cai', 'Nam', 'Cơ Điện Tử', 'KCK', 157),
(158, 'CD0158', 'Võ Đại Thành', '2001-06-11', 'Nam Định', 'Nam', 'Cơ Điện Tử', 'KCK', 158),
(159, 'CD0159', 'Đinh Hồng Phi', '2001-01-22', 'Nghệ An', 'Nam', 'Cơ Điện Tử', 'KCK', 159),
(160, 'CD0160', 'La Văn Việt', '2001-03-12', 'Hà Nội', 'Nam', 'Cơ Điện Tử', 'KCK', 160),
(161, 'CD0181', 'Phạm Văn Bảo', '2001-11-21', 'Hà Nội', 'Nam', 'Điện Tử CN', 'DTVT', 161),
(162, 'CD0182', 'Nguyễn Thị Duyên', '2001-01-11', 'Bắc Ninh', 'Nữ', 'Điện Tử CN', 'DTVT', 162),
(163, 'CD0183', 'Lê Văn Hữu', '2001-12-02', 'Lạng Sơn', 'Nam', 'Điện Tử CN', 'DTVT', 163),
(164, 'CD0184', 'Lê Thị Minh Nguyệt', '2001-07-25', 'Bắc Giang', 'Nữ', 'Điện Tử CN', 'DTVT', 164),
(165, 'CD0185', 'Nguyễn Chí Thống', '2001-09-25', 'Nghệ An', 'Nam', 'Điện Tử CN', 'DTVT', 165),
(166, 'CD0186', 'Hoàng Công Trí', '2001-06-16', 'Lai Châu', 'Nam', 'Điện Tử CN', 'DTVT', 166),
(167, 'CD0187', 'Trần Đức Trung', '2001-08-26', 'Hải Phòng', 'Nam', 'Điện Tử CN', 'DTVT', 167),
(168, 'CD0188', 'Nguyễn Thị Hồng', '2001-04-29', 'Lào Cai', 'Nữ', 'Điện Tử CN', 'DTVT', 168),
(169, 'CD0189', 'Phạm Như Quỳnh', '2001-04-09', 'Yên Bái', 'Nam', 'Điện Tử CN', 'DTVT', 169),
(170, 'CD0190', 'Trần Văn Tịnh', '2001-05-03', 'Hải Dương', 'Nam', 'Điện Tử CN', 'DTVT', 170),
(171, 'CD0191', 'Đoàn Duy Trung', '2001-08-26', 'Thanh Hóa', 'Nam', 'Điện Tử CN', 'DTVT', 171),
(173, 'CD0193', 'Nguyễn Tiến Việt', '2001-03-20', 'Điện Biên', 'Nam', 'Điện Tử CN', 'DTVT', 173),
(174, 'CD0194', 'Phan Danh Việt', '2001-06-26', 'Sơn La', 'Nam', 'Điện Tử CN', 'DTVT', 174),
(175, 'CD0195', 'Quách Lê Việt', '2001-12-15', 'Vĩnh Phúc', 'Nam', 'Điện Tử CN', 'DTVT', 175),
(176, 'CD0196', 'Nguyễn Tuấn Vũ', '2001-04-13', 'Quảng Ninh', 'Nam', 'Điện Tử CN', 'DTVT', 176),
(178, 'CD0198', 'Lưu Quách Thành', '2001-04-16', 'Hà Nội', 'Nam', 'Điện Tử CN', 'DTVT', 178),
(179, 'CD0199', 'Trần Văn Thuận', '2001-09-02', 'Bắc Giang', 'Nam', 'Điện Tử CN', 'DTVT', 179),
(180, 'CD0200', 'Lê Văn Xuân', '2001-01-20', 'Phú Thọ', 'Nam', 'Điện Tử CN', 'DTVT', 180),
(181, 'CD0201', 'Lê Khánh An', '2001-04-04', 'Yên Bái', 'Nam', 'Điện CN', 'DBDCN', 181),
(182, 'CD0202', 'Trương Xuân Cường', '2001-05-01', 'Hà Nam', 'Nam', 'Điện CN', 'DBDCN', 182),
(183, 'CD0203', 'Đỗ Tuấn Duy', '2001-02-11', 'Thái Bình', 'Nam', 'Điện CN', 'DBDCN', 183),
(184, 'CD0204', 'Nguyễn Hữu Duy', '2001-10-26', 'Hải Phòng', 'Nam', 'Điện CN', 'DBDCN', 184),
(185, 'CD0205', 'Đỗ Trung Hòa', '2001-12-09', 'Thanh Hóa', 'Nam', 'Điện CN', 'DBDCN', 185),
(186, 'CD0206', 'Phan Quốc Hưng', '2001-06-11', 'Điện Biên', 'Nam', 'Điện CN', 'DBDCN', 186),
(187, 'CD0207', 'Phạm Nam Quốc Huy', '2001-06-22', 'Phú Thọ', 'Nam', 'Điện CN', 'DBDCN', 187),
(188, 'CD0208', 'Nguyễn Hoàng Bảo Khanh', '2001-01-25', 'Vĩnh Phúc', 'Nam', 'Điện CN', 'DBDCN', 188),
(189, 'CD0209', 'Trương Hải Lâm', '2001-12-25', 'Lạng Sơn', 'Nam', 'Điện CN', 'DBDCN', 189),
(190, 'CD0210', 'Nguyễn Huy Long', '2001-09-13', 'Hà Nội', 'Nam', 'Điện CN', 'DBDCN', 190),
(191, 'CD0211', 'Phạm Quang Minh', '2001-08-14', 'Hưng Yên', 'Nam', 'Điện CN', 'DBDCN', 191),
(192, 'CD0212', 'Chu Huy Minh Nhật', '2001-07-29', 'Nghệ An', 'Nam', 'Điện CN', 'DBDCN', 192),
(193, 'CD0213', 'Lê Nam Phong', '2001-07-13', 'Hà Tĩnh', 'Nam', 'Điện CN', 'DBDCN', 193),
(194, 'CD0214', 'Đoàn Nguyễn Minh Quân', '2001-02-16', 'Hải Dương', 'Nam', 'Điện CN', 'DBDCN', 194),
(195, 'CD0215', 'Hoàng Nguyên Thành', '2001-05-19', 'Hà Nội', 'Nam', 'Điện CN', 'DBDCN', 195),
(196, 'CD0216', 'Nguyễn Năng Việt', '2001-03-06', 'Ninh Bình', 'Nam', 'Điện CN', 'DBDCN', 196),
(197, 'CD0217', 'Đinh Trọng Việt', '2001-10-15', 'Tuyên Quang', 'Nam', 'Điện CN', 'DBDCN', 197),
(198, 'CD0218', 'Nguyễn Đình Vũ', '2001-01-04', 'Bắc Ninh', 'Nam', 'Điện CN', 'DBDCN', 198),
(199, 'CD0219', 'Triệu Lam Vũ', '2001-11-16', 'Sơn La', 'Nam', 'Điện CN', 'DBDCN', 199),
(200, 'CD0220', 'Bùi Sĩ Vương', '2001-12-23', 'Bắc Giang', 'Nam', 'Điện CN', 'DBDCN', 200),
(201, 'CD0221', 'Trần Hồ Đức Anh', '2001-06-09', 'Bắc Ninh', 'Nam', 'Điện Dân Dụng', 'DBDCN', 201),
(202, 'CD0222', 'Phạm Thanh Bình', '2001-09-19', 'Thái Bình', 'Nam', 'Điện Dân Dụng', 'DBDCN', 202),
(203, 'CD0223', 'Nguyễn Tiến Cường', '2001-11-18', 'Bắc Giang', 'Nam', 'Điện Dân Dụng', 'DBDCN', 203),
(204, 'CD0224', 'Lê Chí Dũng', '2001-01-03', 'Hà Nội', 'Nam', 'Điện Dân Dụng', 'DBDCN', 204),
(205, 'CD0225', 'Nguyễn Khắc Duy', '2001-08-30', 'Hải Dương', 'Nam', 'Điện Dân Dụng', 'DBDCN', 205),
(206, 'CD0226', 'Ngô Gia Hạo', '2001-06-04', 'Thanh Hóa', 'Nam', 'Điện Dân Dụng', 'DBDCN', 206),
(207, 'CD0227', 'Trương Việt Hà', '2001-02-27', 'Điện Biên', 'Nam', 'Điện Dân Dụng', 'DBDCN', 207),
(208, 'CD0228', 'Nguyên Hữu Hải', '2001-08-03', 'Sơn La', 'Nam', 'Điện Dân Dụng', 'DBDCN', 208),
(209, 'CD0229', 'Nguyễn Minh Khang', '2001-03-23', 'Lai Châu', 'Nam', 'Điện Dân Dụng', 'DBDCN', 209),
(210, 'CD0230', 'Nguyễn Phú Duy Long', '2001-08-14', 'Hải Phòng', 'Nam', 'Điện Dân Dụng', 'DBDCN', 210),
(211, 'CD0231', 'Vũ Trần Nhật Minh', '2001-01-13', 'Vĩnh Phúc', 'Nam', 'Điện Dân Dụng', 'DBDCN', 211),
(212, 'CD0232', 'Nguyễn Khôi Nguyên', '2001-09-08', 'Hà Nội', 'Nam', 'Điện Dân Dụng', 'DBDCN', 212),
(213, 'CD0233', 'Dương Bảo Minh Phúc', '2001-03-08', 'Hà Nam', 'Nam', 'Điện Dân Dụng', 'DBDCN', 213),
(214, 'CD0234', 'Lê Hoàng Quân', '2001-08-21', 'Lạng Sơn', 'Nam', 'Điện Dân Dụng', 'DBDCN', 214),
(215, 'CD0235', 'Phạm Vũ Quang Thanh', '2001-05-30', 'Phú Thọ', 'Nam', 'Điện Dân Dụng', 'DBDCN', 215),
(216, 'CD0236', 'Dương Quang Trường', '2001-05-13', 'Hà Nội', 'Nam', 'Điện Dân Dụng', 'DBDCN', 216),
(217, 'CD0237', 'Lưu Văn Việt', '2001-05-19', 'Vĩnh Phúc', 'Nam', 'Điện Dân Dụng', 'DBDCN', 217),
(218, 'CD0238', 'Bùi Đại Vũ', '2001-03-19', 'Hà Nội', 'Nam', 'Điện Dân Dụng', 'DBDCN', 218),
(219, 'CD0239', 'Triệu Long Vũ', '2001-03-23', 'Phú Thọ', 'Nam', 'Điện Dân Dụng', 'DBDCN', 219),
(220, 'CD0240', 'Vương Đình Vũ', '2001-12-16', 'Hải Phòng', 'Nam', 'Điện Dân Dụng', 'DBDCN', 220),
(221, 'CD0241', 'Vũ Thiên Bảo', '2001-04-12', 'Quảng Ninh', 'Nam', 'KTLDD', 'DBDCN', 221),
(222, 'CD0242', 'Đoàn Văn Bình', '2001-07-17', 'Hà Nội', 'Nam', 'KTLDD', 'DBDCN', 222),
(223, 'CD0243', 'Nguyễn Mạnh Đạt', '2001-05-15', 'Lạng Sơn', 'Nam', 'KTLDD', 'DBDCN', 223),
(224, 'CD0244', 'Trịnh Trương Phúc Hải', '2001-09-22', 'Hải Phòng', 'Nam', 'KTLDD', 'DBDCN', 224),
(225, 'CD0245', 'Đoàn Mạnh Hiếu', '2001-03-10', 'Tuyên Quang', 'Nam', 'KTLDD', 'DBDCN', 225),
(226, 'CD0246', 'Phạm Văn Huy', '2001-05-18', 'Hà Nam', 'Nam', 'KTLDD', 'DBDCN', 226),
(227, 'CD0247', 'Đỗ Nguyên Hưng', '2001-07-30', 'Hải Dương', 'Nam', 'KTLDD', 'DBDCN', 227),
(228, 'CD0248', 'Nguyễn Quang Hưng', '2001-01-11', 'Sơn La', 'Nam', 'KTLDD', 'DBDCN', 228),
(229, 'CD0249', 'Lương Hoàng Hải Nam', '2001-06-19', 'Thanh Hóa', 'Nam', 'KTLDD', 'DBDCN', 229),
(230, 'CD0250', 'Nguyễn Bảo Nam', '2001-02-12', 'Bắc Giang', 'Nam', 'KTLDD', 'DBDCN', 230),
(231, 'CD0251', 'Nguyễn Hải Nam', '2001-12-26', 'Hà Nam', 'Nam', 'KTLDD', 'DBDCN', 231),
(232, 'CD0252', 'Võ Khôi Nguyên', '2001-08-08', 'Vĩnh Phúc', 'Nam', 'KTLDD', 'DBDCN', 232),
(233, 'CD0253', 'Hoàng Hải Quân', '2001-09-26', 'Phú Thọ', 'Nam', 'KTLDD', 'DBDCN', 233),
(234, 'CD0254', 'Lê Hoàng Quân', '2001-05-22', 'Hà Nội', 'Nam', 'KTLDD', 'DBDCN', 234),
(235, 'CD0255', 'Trần Thành Tâm', '2001-09-29', 'Cao Bằng', 'Nam', 'KTLDD', 'DBDCN', 235),
(236, 'CD0256', 'Nguyễn Hoàng Thái', '2001-11-17', 'Bắc Kạn', 'Nam', 'KTLDD', 'DBDCN', 236),
(237, 'CD0257', 'Đỗ Phúc Thăng', '2001-03-20', 'Hà Giang', 'Nam', 'KTLDD', 'DBDCN', 237),
(238, 'CD0258', 'Vũ Đức Việt', '2001-05-18', 'Hà Nội', 'Nam', 'KTLDD', 'DBDCN', 238),
(239, 'CD0259', 'Phạm Tiến Việt', '2001-11-12', 'Hải Phòng', 'Nam', 'KTLDD', 'DBDCN', 239),
(240, 'CD0260', 'Khổng Minh Vũ', '2001-09-19', 'Hải Phòng', 'Nam', 'KTLDD', 'DBDCN', 240),
(241, 'CD0261', 'Mai Thịnh Anh', '2001-12-25', 'Lạng Sơn', 'Nam', 'Máy Lạnh ĐH', 'DBDCN', 241),
(242, 'CD0262', 'Nguyễn Phan Anh', '2001-03-25', 'Thanh Hóa', 'Nam', 'Máy Lạnh ĐH', 'DBDCN', 242),
(243, 'CD0263', 'Phạm Tùng Bách', '2001-11-20', 'Hải Dương', 'Nam', 'Máy Lạnh ĐH', 'DBDCN', 243),
(244, 'CD0264', 'Phạm Hải Bình', '2001-09-17', 'Vĩnh Phúc', 'Nam', 'Máy Lạnh ĐH', 'DBDCN', 244),
(245, 'CD0265', 'Nguyễn Thành Đạt', '2001-09-23', 'Lào Cai', 'Nam', 'Máy Lạnh ĐH', 'DBDCN', 245),
(246, 'CD0266', 'Phạm Gia Hiếu', '2001-09-25', 'Phú Thọ', 'Nam', 'Máy Lạnh ĐH', 'DBDCN', 246),
(247, 'CD0267', 'Trần Minh Huy', '2001-07-29', 'Thanh Hóa', 'Nam', 'Máy Lạnh ĐH', 'DBDCN', 247),
(248, 'CD0268', 'Nguyễn Minh Hưng', '2001-02-15', 'Cao Bằng', 'Nam', 'Máy Lạnh ĐH', 'DBDCN', 248),
(249, 'CD0269', 'Nguyễn Bảo Minh', '2001-03-07', 'Hà Nội', 'Nam', 'Máy Lạnh ĐH', 'DBDCN', 249),
(251, 'CD0271', 'Nguyễn Phương Nam', '2001-07-08', 'Quảng Ninh', 'Nam', 'Máy Lạnh ĐH', 'DBDCN', 251),
(252, 'CD0272', 'Vũ Đình Nam', '2001-11-12', 'Thái Bình', 'Nam', 'Máy Lạnh ĐH', 'DBDCN', 252),
(253, 'CD0273', 'Bùi Minh Quân', '2001-07-08', 'Ninh Bình', 'Nam', 'Máy Lạnh ĐH', 'DBDCN', 253),
(254, 'CD0274', 'Chu Minh Quyền', '2001-11-03', 'Hà Nội', 'Nam', 'Máy Lạnh ĐH', 'DBDCN', 254),
(255, 'CD0275', 'Vũ Trọng Tùng', '2001-05-20', 'Hà Nam', 'Nam', 'Máy Lạnh ĐH', 'DBDCN', 255),
(256, 'CD0276', 'Nguyễn Hoàng Thái', '2001-08-16', 'Hà Nội', 'Nam', 'Máy Lạnh ĐH', 'DBDCN', 256),
(257, 'CD0277', 'Nguyễn Thanh Tùng', '2001-09-09', 'Nghệ An', 'Nam', 'Máy Lạnh ĐH', 'DBDCN', 257),
(258, 'CD0278', 'Quách Đạt Vương', '2001-09-26', 'Bắc Giang', 'Nam', 'Máy Lạnh ĐH', 'DBDCN', 258),
(259, 'CD0279', 'Lê Đức Vương', '2001-03-09', 'Hưng Yên', 'Nam', 'Máy Lạnh ĐH', 'DBDCN', 259),
(260, 'CD0280', 'Đặng Văn Vũ', '2001-09-07', 'Cao Bằng', 'Nam', 'Máy Lạnh ĐH', 'DBDCN', 260),
(261, 'CD0281', 'Đoàn Nguyễn Phương Anh', '2001-09-21', 'Hưng Yên', 'Nữ', 'Kế Toán DN', 'KTQL', 261),
(262, 'CD0282', 'Đỗ Diệu Anh', '2001-01-12', 'Bắc Giang', 'Nữ', 'Kế Toán DN', 'KTQL', 262),
(263, 'CD0283', 'Nguyễn Tuệ Anh', '2001-09-04', 'Hà Nội', 'Nữ', 'Kế Toán DN', 'KTQL', 263),
(264, 'CD0284', 'Phạm Nguyễn Bảo Anh', '2001-01-01', 'Vĩnh Phúc', 'Nữ', 'Kế Toán DN', 'KTQL', 264),
(265, 'CD0285', 'Tạ Thùy Anh', '2001-12-26', 'Hải Phòng', 'Nữ', 'Kế Toán DN', 'KTQL', 265),
(266, 'CD0286', 'Mai Quỳnh Chi', '2001-06-21', 'Thanh Hóa', 'Nữ', 'Kế Toán DN', 'KTQL', 266),
(267, 'CD0287', 'Hà Thị Ngọc Dung', '2001-03-10', 'Bắc Ninh', 'Nữ', 'Kế Toán DN', 'KTQL', 267),
(268, 'CD0288', 'Nghiêm Hương Giang', '2001-10-01', 'Hà Nội', 'Nữ', 'Kế Toán DN', 'KTQL', 268),
(269, 'CD0289', 'Đỗ Hoàng Bảo Hà', '2001-07-13', 'Lào Cai', 'Nữ', 'Kế Toán DN', 'KTQL', 269),
(270, 'CD0290', 'Phan Ngọc Hà', '2001-05-20', 'Bắc Giang', 'Nữ', 'Kế Toán DN', 'KTQL', 270),
(271, 'CD0291', 'Nguyễn Thúy Hằng', '2001-02-02', 'Tuyên Quang', 'Nữ', 'Kế Toán DN', 'KTQL', 271),
(272, 'CD0292', 'Phạm Chi Mai', '2001-07-23', 'Hải Phòng', 'Nữ', 'Kế Toán DN', 'KTQL', 272),
(273, 'CD0293', 'Hoàng Minh Phương', '2001-02-15', 'Ninh Bình', 'Nữ', 'Kế Toán DN', 'KTQL', 273),
(274, 'CD0294', 'Trần Dương Hà Phương', '2001-02-18', 'Bắc Giang', 'Nữ', 'Kế Toán DN', 'KTQL', 274),
(275, 'CD0295', 'Hoàng Ngọc Khanh Tâm', '2001-05-06', 'Bắc Giang', 'Nữ', 'Kế Toán DN', 'KTQL', 275),
(276, 'CD0296', 'Lương Hồng Trang', '2001-04-14', 'Lào Cai', 'Nữ', 'Kế Toán DN', 'KTQL', 276),
(277, 'CD0297', 'Bùi Thanh Trúc', '2001-05-05', 'Thanh Hóa', 'Nữ', 'Kế Toán DN', 'KTQL', 277),
(278, 'CD0298', 'Vũ Ngọc Minh Uyên', '2001-04-14', 'Hưng Yên', 'Nữ', 'Kế Toán DN', 'KTQL', 278),
(279, 'CD0299', 'Nguyễn Thanh Vân', '2001-05-10', 'Hưng Yên', 'Nữ', 'Kế Toán DN', 'KTQL', 279),
(280, 'CD0300', 'Đoàn Phương Vy', '2001-06-13', 'Hưng Yên', 'Nữ', 'Kế Toán DN', 'KTQL', 280),
(281, 'CD0301', 'Nguyễn Ngọc Khánh An', '2001-09-23', 'Yên Bái', 'Nữ', 'Quản Lý DN', 'KTQL', 281),
(282, 'CD0302', 'Vũ Thu An', '2001-07-01', 'Hà Nội', 'Nữ', 'Quản Lý DN', 'KTQL', 282),
(283, 'CD0303', 'Lê Hà Trúc Anh', '2001-08-08', 'Hải Phòng', 'Nữ', 'Quản Lý DN', 'KTQL', 283),
(284, 'CD0304', 'Vương Hiền Anh', '2001-02-14', 'Lào Cai', 'Nữ', 'Quản Lý DN', 'KTQL', 284),
(285, 'CD0305', 'Phạm Ngọc Chi', '2001-01-29', 'Hưng Yên', 'Nữ', 'Quản Lý DN', 'KTQL', 285),
(286, 'CD0306', 'Phạm Nguyễn Ngọc Diệp', '2001-10-17', 'Nam Định', 'Nữ', 'Quản Lý DN', 'KTQL', 286),
(287, 'CD0307', 'Trần Bảo Hà', '2001-09-30', 'Nam Định', 'Nữ', 'Quản Lý DN', 'KTQL', 287),
(288, 'CD0308', 'Đỗ Phương Nga', '2001-03-13', 'Phú Thọ', 'Nữ', 'Quản Lý DN', 'KTQL', 288),
(289, 'CD0309', 'Lê Ngọc Phương Linh', '2001-12-12', 'Yên Bái', 'Nữ', 'Quản Lý DN', 'KTQL', 289),
(290, 'CD0310', 'Lê Phương Mai', '2001-06-21', 'Bắc Ninh', 'Nữ', 'Quản Lý DN', 'KTQL', 290),
(291, 'CD0311', 'Đỗ Hà My', '2001-04-10', 'Vĩnh Phúc', 'Nữ', 'Quản Lý DN', 'KTQL', 291),
(292, 'CD0312', 'Nguyễn Ngọc Bảo Nhi', '2001-02-22', 'Hải Dương', 'Nữ', 'Quản Lý DN', 'KTQL', 292),
(293, 'CD0313', 'Phạm Thu Phương', '2001-04-16', 'Hải Phòng', 'Nữ', 'Quản Lý DN', 'KTQL', 293),
(294, 'CD0314', 'Lưu Thị Thu Phương', '2001-08-24', 'Hà Nội', 'Nữ', 'Quản Lý DN', 'KTQL', 294),
(295, 'CD0315', 'Đỗ Thị Phương', '2001-04-11', 'Hà Nội', 'Nữ', 'Quản Lý DN', 'KTQL', 295),
(296, 'CD0316', 'Nguyễn Thu Trang', '2001-03-31', 'Sơn La', 'Nữ', 'Quản Lý DN', 'KTQL', 296),
(297, 'CD0317', 'Đồng Thị Trang', '2001-12-13', 'Hà Nội', 'Nữ', 'Quản Lý DN', 'KTQL', 297),
(298, 'CD0318', 'Phạm Tú Uyên', '2001-03-10', 'Vĩnh Phúc', 'Nữ', 'Quản Lý DN', 'KTQL', 298),
(299, 'CD0319', 'Nguyễn Tường Vy', '2001-08-25', 'Nam Định', 'Nữ', 'Quản Lý DN', 'KTQL', 299),
(300, 'CD0320', 'Lê Diệp Vy', '2001-04-29', 'Hà Nội', 'Nữ', 'Quản Lý DN', 'KTQL', 300),
(301, 'CD0321', 'Bùi Ngọc Trâm Anh', '2001-09-10', 'Hà Nội', 'Nữ', 'Thương Mại ĐT', 'KTQL', 301),
(302, 'CD0322', 'Vũ Hoàng Gia Bảo', '2001-09-25', 'Hà Nội', 'Nam', 'Thương Mại ĐT', 'KTQL', 302),
(303, 'CD0323', 'Nguyễn Hữu Bình', '2001-10-30', 'Bắc Ninh', 'Nam', 'Thương Mại ĐT', 'KTQL', 303),
(304, 'CD0324', 'Hoàng Trung Dũng', '2001-08-30', 'Phú Thọ', 'Nam', 'Thương Mại ĐT', 'KTQL', 304),
(305, 'CD0325', 'Đồng Mạnh Duy', '2001-05-10', 'Thanh Hóa', 'Nam', 'Thương Mại ĐT', 'KTQL', 305),
(306, 'CD0326', 'Nguyễn Ngân Hà', '2001-07-19', 'Bắc Giang', 'Nữ', 'Thương Mại ĐT', 'KTQL', 306),
(307, 'CD0327', 'Lưu Ngọc Bảo Hân', '2001-01-16', 'Yên Bái', 'Nữ', 'Thương Mại ĐT', 'KTQL', 307),
(308, 'CD0328', 'Nguyễn Minh Hiển', '2001-05-26', 'Hải Phòng', 'Nam', 'Thương Mại ĐT', 'KTQL', 308),
(309, 'CD0329', 'Vũ Hà Linh', '2001-10-20', 'Hưng Yên', 'Nữ', 'Thương Mại ĐT', 'KTQL', 309),
(310, 'CD0330', 'Trần Bảo Long', '2001-10-25', 'Hải Dương', 'Nam', 'Thương Mại ĐT', 'KTQL', 310),
(311, 'CD0331', 'Đàm Tuệ Minh', '2001-09-15', 'Phú Thọ', 'Nữ', 'Thương Mại ĐT', 'KTQL', 311),
(312, 'CD0332', 'Lê Bảo Nam', '2001-10-25', 'Hà Nội', 'Nam', 'Thương Mại ĐT', 'KTQL', 312),
(313, 'CD0333', 'Nguyễn Diệu Bích Ngân', '2001-11-11', 'Hà Nội', 'Nữ', 'Thương Mại ĐT', 'KTQL', 313),
(314, 'CD0334', 'Vũ Thị Yến Nhi', '2001-04-24', 'Nghệ An', 'Nữ', 'Thương Mại ĐT', 'KTQL', 314),
(315, 'CD0335', 'Nguyễn An Hải Phong', '2001-04-02', 'Bắc Giang', 'Nam', 'Thương Mại ĐT', 'KTQL', 315),
(316, 'CD0336', 'Vũ Thế Phong', '2001-10-26', 'Thái Bình', 'Nam', 'Thương Mại ĐT', 'KTQL', 316),
(317, 'CD0337', 'Nguyễn Hà Phương', '2001-09-27', 'Nghệ An', 'Nữ', 'Thương Mại ĐT', 'KTQL', 317),
(318, 'CD0338', 'Nguyễn Nam Thành', '2001-01-03', 'Thái Bình', 'Nam', 'Thương Mại ĐT', 'KTQL', 318),
(319, 'CD0339', 'Nguyễn Ngọc Anh Thư', '2001-08-29', 'Ninh Bình', 'Nữ', 'Thương Mại ĐT', 'KTQL', 319),
(320, 'CD0340', 'Hoàng Ngọc Bảo Trâm', '2001-08-11', 'Hà Nội', 'Nữ', 'Thương Mại ĐT', 'KTQL', 320),
(321, 'CD0341', 'Trần Quang Anh', '2001-12-13', 'Nam Định', 'Nam', 'Ứng Dụng PM', 'CNTT', 321),
(322, 'CD0342', 'Đoàn Giang Hoàng Bảo', '2001-06-07', 'Phú Thọ', 'Nam', 'Ứng Dụng PM', 'CNTT', 322),
(323, 'CD0343', 'Nguyễn Thái Bảo', '2001-11-09', 'Yên Bái', 'Nam', 'Ứng Dụng PM', 'CNTT', 323),
(324, 'CD0344', 'Nguyễn Chí Châu', '2001-02-14', 'Bắc Ninh', 'Nam', 'Ứng Dụng PM', 'CNTT', 324),
(325, 'CD0345', 'Đỗ Bùi Thanh Hải', '2001-11-28', 'Vĩnh Phúc', 'Nam', 'Ứng Dụng PM', 'CNTT', 325),
(326, 'CD0346', 'Hà Ngọc Hùng', '2001-10-21', 'Hải Dương', 'Nam', 'Ứng Dụng PM', 'CNTT', 326),
(327, 'CD0347', 'Trần Tuấn Hùng', '2001-04-15', 'Hải Phòng', 'Nam', 'Ứng Dụng PM', 'CNTT', 327),
(328, 'CD0348', 'Ngô Vũ Gia Huy', '2001-09-23', 'Hà Nội', 'Nam', 'Ứng Dụng PM', 'CNTT', 328),
(329, 'CD0349', 'Đào Phúc Hưng', '2001-07-30', 'Hà Nội', 'Nam', 'Ứng Dụng PM', 'CNTT', 329),
(330, 'CD0350', 'Đặng Tùng Lâm', '2001-03-02', 'Sơn La', 'Nam', 'Ứng Dụng PM', 'CNTT', 330),
(331, 'CD0351', 'Phí Đức Minh', '2001-01-16', 'Hà Nội', 'Nam', 'Ứng Dụng PM', 'CNTT', 331),
(332, 'CD0352', 'Trịnh Nhật Minh', '2001-07-23', 'Vĩnh Phúc', 'Nam', 'Ứng Dụng PM', 'CNTT', 332),
(333, 'CD0353', 'Phạm Đức Nam', '2001-06-13', 'Nam Định', 'Nam', 'Ứng Dụng PM', 'CNTT', 333),
(334, 'CD0354', 'Đào Hồng Ngọc', '2001-05-12', 'Hà Nội', 'Nữ', 'Ứng Dụng PM', 'CNTT', 334),
(335, 'CD0355', 'Nguyễn Thị Thanh Ngọc', '2001-12-09', 'Bắc Giang', 'Nữ', 'Ứng Dụng PM', 'CNTT', 335),
(336, 'CD0356', 'Đặng Hải Phong', '2001-03-31', 'Yên Bái', 'Nam', 'Ứng Dụng PM', 'CNTT', 336),
(337, 'CD0357', 'Nguyễn Việt Bảo Phúc', '2001-10-14', 'Hải Phòng', 'Nam', 'Ứng Dụng PM', 'CNTT', 337),
(338, 'CD0358', 'Nguyễn Bảo Quyên', '2001-08-09', 'Hưng Yên', 'Nữ', 'Ứng Dụng PM', 'CNTT', 338),
(339, 'CD0359', 'Trương Đức Thành', '2001-06-03', 'Hải Dương', 'Nam', 'Ứng Dụng PM', 'CNTT', 339),
(340, 'CD0360', 'Phạm Ngọc Thiên Trang', '2001-10-23', 'Phú Thọ', 'Nữ', 'Ứng Dụng PM', 'CNTT', 340),
(341, 'CD0361', 'Lê Thành An', '2001-07-16', 'Hà Nội', 'Nam', 'TKĐH', 'CNTT', 341),
(342, 'CD0362', 'Nguyễn Bình An', '2001-03-11', 'Hà Nội', 'Nam', 'TKĐH', 'CNTT', 342),
(343, 'CD0363', 'Bùi Phạm Quỳnh Anh', '2001-06-20', 'Nghệ An', 'Nữ', 'TKĐH', 'CNTT', 343),
(344, 'CD0364', 'Trịnh Xuân Bách', '2001-03-07', 'Bắc Giang', 'Nam', 'TKĐH', 'CNTT', 344),
(345, 'CD0365', 'Đào Hùng Cường', '2001-10-22', 'Hải Phòng', 'Nam', 'TKĐH', 'CNTT', 345),
(346, 'CD0366', 'Đào Ngọc Diệp', '2001-06-08', 'Lào Cai', 'Nữ', 'TKĐH', 'CNTT', 346),
(347, 'CD0367', 'Dương Hoàng Duy', '2001-12-22', 'Hưng Yên', 'Nam', 'TKĐH', 'CNTT', 347),
(348, 'CD0368', 'Nguyễn Thùy Dương', '2001-08-07', 'Nam Định', 'Nữ', 'TKĐH', 'CNTT', 348),
(349, 'CD0369', 'Phạm Tuấn Dương', '2001-01-22', 'Nam Định', 'Nam', 'TKĐH', 'CNTT', 349),
(350, 'CD0370', 'Nguyễn Hoàng Minh Đức', '2001-10-11', 'Phú Thọ', 'Nam', 'TKĐH', 'CNTT', 350),
(351, 'CD0371', 'Nguyễn Đức Huy', '2001-11-16', 'Yên Bái', 'Nam', 'TKĐH', 'CNTT', 351),
(352, 'CD0372', 'Kiều Việt Hưng', '2001-07-30', 'Bắc Ninh', 'Nam', 'TKĐH', 'CNTT', 352),
(353, 'CD0373', 'Đàm Nam Khánh', '2001-01-18', 'Vĩnh Phúc', 'Nam', 'TKĐH', 'CNTT', 353),
(354, 'CD0374', 'Hà Minh Khoa', '2001-05-05', 'Hải Dương', 'Nam', 'TKĐH', 'CNTT', 354),
(355, 'CD0375', 'Nguyễn Đào Mỹ Linh', '2001-12-20', 'Hải Phòng', 'Nữ', 'TKĐH', 'CNTT', 355),
(356, 'CD0376', 'Nguyễn Tuấn Minh', '2001-09-22', 'Hà Nội', 'Nam', 'TKĐH', 'CNTT', 356),
(357, 'CD0377', 'Phạm Minh Trí', '2001-08-26', 'Thái Bình', 'Nam', 'TKĐH', 'CNTT', 357),
(358, 'CD0378', 'Phạm Xuân Việt', '2001-10-22', 'Ninh Bình', 'Nam', 'TKĐH', 'CNTT', 358),
(359, 'CD0379', 'Đặng Hà Vy', '2001-05-28', 'Hà Nội', 'Nữ', 'TKĐH', 'CNTT', 359),
(360, 'CD0380', 'Lê Hà Vy', '2001-01-27', 'Hà Nam', 'Nữ', 'TKĐH', 'CNTT', 360),
(361, 'CD0381', 'Lê Việt Anh', '2001-06-09', 'Hà Nội', 'Nam', 'Lập Trình MT', 'CNTT', 361),
(362, 'CD0382', 'Lê Gia Bảo', '2001-04-13', 'Nghệ An', 'Nam', 'Lập Trình MT', 'CNTT', 362),
(363, 'CD0383', 'Nguyễn Thiên Bảo', '2001-06-24', 'Bắc Giang', 'Nam', 'Lập Trình MT', 'CNTT', 363),
(364, 'CD0384', 'Hà Gia Huy', '2001-02-06', 'Hưng Yên', 'Nam', 'Lập Trình MT', 'CNTT', 364),
(365, 'CD0385', 'Bùi Tuấn Hưng', '2001-07-13', 'Cao Bằng', 'Nam', 'Lập Trình MT', 'CNTT', 365),
(366, 'CD0386', 'Đặng Tiến Hưng', '2001-08-23', 'Hưng Yên', 'Nam', 'Lập Trình MT', 'CNTT', 366),
(367, 'CD0387', 'Trần Đình Khang', '2001-09-27', 'Bắc Giang', 'Nam', 'Lập Trình MT', 'CNTT', 367),
(368, 'CD0388', 'Khổng Trung Khánh', '2001-09-20', 'Sơn La', 'Nam', 'Lập Trình MT', 'CNTT', 368),
(369, 'CD0389', 'Nguyễn Thế Kiên', '2001-01-02', 'Hà Nội', 'Nam', 'Lập Trình MT', 'CNTT', 369),
(370, 'CD0390', 'Nguyễn Tuấn Kiệt', '2001-07-17', 'Vĩnh Phúc', 'Nam', 'Lập Trình MT', 'CNTT', 370),
(371, 'CD0391', 'Nguyễn Nhật Minh', '2001-12-23', 'Nam Định', 'Nam', 'Lập Trình MT', 'CNTT', 371),
(372, 'CD0392', 'Vũ Nam Phong', '2001-11-15', 'Hà Nội', 'Nam', 'Lập Trình MT', 'CNTT', 372),
(373, 'CD0393', 'Nguyễn Thái Sơn', '2001-05-17', 'Hà Nội', 'Nam', 'Lập Trình MT', 'CNTT', 373),
(374, 'CD0394', 'Nguyễn Phú Vinh', '2001-08-12', 'Hà Nội', 'Nam', 'Lập Trình MT', 'CNTT', 374),
(375, 'CD0395', 'Trần Nam Việt', '2001-08-18', 'Bắc Ninh', 'Nam', 'Lập Trình MT', 'CNTT', 375),
(376, 'CD0396', 'Lưu Đức Việt', '2001-10-25', 'Phú Thọ', 'Nam', 'Lập Trình MT', 'CNTT', 376),
(377, 'CD0397', 'Cao Đức Vũ', '2001-03-26', 'Thanh Hóa', 'Nam', 'Lập Trình MT', 'CNTT', 377),
(378, 'CD0398', 'Trần Huy Vũ', '2001-06-11', 'Bắc Giang', 'Nam', 'Lập Trình MT', 'CNTT', 378),
(379, 'CD0399', 'Phạm Minh Vương', '2001-11-28', 'Yên Bái', 'Nam', 'Lập Trình MT', 'CNTT', 379),
(380, 'CD0400', 'Quách Tiến Vương', '2001-12-24', 'Hải Phòng', 'Nam', 'Lập Trình MT', 'CNTT', 380),
(381, 'CD0401', 'Trương Tùng Anh', '2001-01-10', 'Hưng Yên', 'Nam', 'Quản Trị Mạng', 'CNTT', 381),
(382, 'CD0402', 'Lê Hoàng Bách', '2001-08-08', 'Bắc Giang', 'Nam', 'Quản Trị Mạng', 'CNTT', 382),
(383, 'CD0403', 'Vũ Tiến Đạt', '2001-05-04', 'Hà Nội', 'Nam', 'Quản Trị Mạng', 'CNTT', 383),
(384, 'CD0404', 'Hoàng Việt Đức', '2001-09-21', 'Hải Dương', 'Nam', 'Quản Trị Mạng', 'CNTT', 384),
(385, 'CD0405', 'Nguyễn Hoàng Hải', '2001-08-07', 'Thanh Hóa', 'Nam', 'Quản Trị Mạng', 'CNTT', 385),
(386, 'CD0406', 'Trần Việt Hiếu', '2001-09-28', 'Điện Biên', 'Nam', 'Quản Trị Mạng', 'CNTT', 386),
(387, 'CD0407', 'Phạm Gia Huy', '2001-02-12', 'Sơn La', 'Nam', 'Quản Trị Mạng', 'CNTT', 387),
(388, 'CD0408', 'Bùi Duy Hưng', '2001-01-04', 'Lai Châu', 'Nam', 'Quản Trị Mạng', 'CNTT', 388),
(389, 'CD0409', 'Phạm Bảo Khang', '2001-04-15', 'Hải Phòng', 'Nam', 'Quản Trị Mạng', 'CNTT', 389),
(390, 'CD0410', 'Phạm Công Khanh', '2001-04-26', 'Vĩnh Phúc', 'Nam', 'Quản Trị Mạng', 'CNTT', 390),
(391, 'CD0411', 'Nguyễn Anh Khôi', '2001-09-11', 'Hà Nội', 'Nam', 'Quản Trị Mạng', 'CNTT', 391),
(392, 'CD0412', 'Tạ Gia Lộc', '2001-08-24', 'Hà Nam', 'Nam', 'Quản Trị Mạng', 'CNTT', 392),
(393, 'CD0413', 'Đào Quang Minh', '2001-07-04', 'Lạng Sơn', 'Nam', 'Quản Trị Mạng', 'CNTT', 393),
(394, 'CD0414', 'Chu Nguyên Nam', '2001-12-21', 'Phú Thọ', 'Nam', 'Quản Trị Mạng', 'CNTT', 394),
(395, 'CD0415', 'Trương Bảo Nam', '2001-02-18', 'Hà Nội', 'Nam', 'Quản Trị Mạng', 'CNTT', 395),
(396, 'CD0416', 'Hoàng Bảo Phúc', '2001-08-02', 'Vĩnh Phúc', 'Nam', 'Quản Trị Mạng', 'CNTT', 396),
(397, 'CD0417', 'Nguyễn Trường Thuận', '2001-09-19', 'Hà Nội', 'Nam', 'Quản Trị Mạng', 'CNTT', 397),
(398, 'CD0418', 'Nguyễn Văn Trường', '2001-08-28', 'Phú Thọ', 'Nam', 'Quản Trị Mạng', 'CNTT', 398),
(399, 'CD0419', 'Lê Văn Thái', '2001-09-03', 'Hải Phòng', 'Nam', 'Quản Trị Mạng', 'CNTT', 399),
(400, 'CD0420', 'Đồng Văn Vũ', '2001-09-25', 'Quảng Ninh', 'Nam', 'Quản Trị Mạng', 'CNTT', 400);

-- --------------------------------------------------------

--
-- Table structure for table `upload`
--

CREATE TABLE `upload` (
  `id` int(255) NOT NULL,
  `name` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  `image` longblob NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `users`
--

CREATE TABLE `users` (
  `id` int(11) NOT NULL,
  `username` varchar(255) NOT NULL,
  `email` varchar(255) NOT NULL,
  `password` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `users`
--

INSERT INTO `users` (`id`, `username`, `email`, `password`) VALUES
(13, 'son', 'son@gmail.com', 'c4ca4238a0b923820dcc509a6f75849b');

-- --------------------------------------------------------

--
-- Table structure for table `users_login`
--

CREATE TABLE `users_login` (
  `id` int(11) NOT NULL,
  `email` varchar(50) COLLATE utf8_unicode_ci NOT NULL,
  `password` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  `created_at` datetime DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Dumping data for table `users_login`
--

INSERT INTO `users_login` (`id`, `email`, `password`, `created_at`) VALUES
(1, 'haivd123@gmail.com', '$2y$10$VoAxZ1cX7GxG6720CXAp8e.6e0zHhGgYzJ5sdhSAGMporhVSKeMIe', '2022-05-16 23:47:33');

-- --------------------------------------------------------

--
-- Table structure for table `users_search`
--

CREATE TABLE `users_search` (
  `id` int(11) NOT NULL,
  `masv` varchar(191) COLLATE utf8_unicode_ci NOT NULL,
  `hoten` varchar(100) COLLATE utf8_unicode_ci NOT NULL,
  `diachi` varchar(100) COLLATE utf8_unicode_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Dumping data for table `users_search`
--

INSERT INTO `users_search` (`id`, `masv`, `hoten`, `diachi`) VALUES
(1, 'Hai', 'Bui', 'havui@gmail.com'),
(2, 'Son', 'Pham', 'sonbom@gmail.com\r\n');

-- --------------------------------------------------------

--
-- Table structure for table `user_form`
--

CREATE TABLE `user_form` (
  `id` int(100) NOT NULL,
  `name` varchar(100) NOT NULL,
  `email` varchar(100) NOT NULL,
  `password` varchar(100) NOT NULL,
  `image` varchar(100) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `user_form`
--

INSERT INTO `user_form` (`id`, `name`, `email`, `password`, `image`) VALUES
(1, 'hai', 'hai@gmail.com', '202cb962ac59075b964b07152d234b70', '');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `charts`
--
ALTER TABLE `charts`
  ADD PRIMARY KEY (`chart_id`);

--
-- Indexes for table `CHITIETKETQUA`
--
ALTER TABLE `CHITIETKETQUA`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `GIAOVIEN`
--
ALTER TABLE `GIAOVIEN`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `KETQUA`
--
ALTER TABLE `KETQUA`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `KHOA`
--
ALTER TABLE `KHOA`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `SINHVIEN`
--
ALTER TABLE `SINHVIEN`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `upload`
--
ALTER TABLE `upload`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `users_login`
--
ALTER TABLE `users_login`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `email` (`email`);

--
-- Indexes for table `users_search`
--
ALTER TABLE `users_search`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `user_form`
--
ALTER TABLE `user_form`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `charts`
--
ALTER TABLE `charts`
  MODIFY `chart_id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `CHITIETKETQUA`
--
ALTER TABLE `CHITIETKETQUA`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=421;

--
-- AUTO_INCREMENT for table `GIAOVIEN`
--
ALTER TABLE `GIAOVIEN`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=168;

--
-- AUTO_INCREMENT for table `KETQUA`
--
ALTER TABLE `KETQUA`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=165;

--
-- AUTO_INCREMENT for table `KHOA`
--
ALTER TABLE `KHOA`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=7;

--
-- AUTO_INCREMENT for table `SINHVIEN`
--
ALTER TABLE `SINHVIEN`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=401;

--
-- AUTO_INCREMENT for table `upload`
--
ALTER TABLE `upload`
  MODIFY `id` int(255) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `users`
--
ALTER TABLE `users`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=14;

--
-- AUTO_INCREMENT for table `users_login`
--
ALTER TABLE `users_login`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `users_search`
--
ALTER TABLE `users_search`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT for table `user_form`
--
ALTER TABLE `user_form`
  MODIFY `id` int(100) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
